/* OID.strings
/*
/* This file maps object identifiers (OIDs) to their corresponding labels.
/* These labels are used when displaying the details of a certificate's contents.
/*
/* NOTE TO LOCALIZERS:
/*
/* All strings in this file should eventually be localized. However, not all of them are
/* currently localizable. Specifically, there are a number of acronymns and abbreviations
/* which still need to be expanded into the corresponding English words. [3751398]
/*
/* Acronymns, such as "RSA," "DES," "X.509," "S/MIME," and so on, should be left alone for now.
/* Abbreviated labels such as "id-aa-dvcs-dvc" should also not be localized if present.


/* Deutsche Telekom */

"06 05 02 82 06 01 0A"			= "Telesec";
"06 06 02 82 06 01 0A 00"		= "Telesec 延伸功能";
"06 06 02 82 06 01 0A 01"		= "Telesec 機制";

"06 07 02 82 06 01 0A 01 00"	= "Telesec 認證";
"06 08 02 82 06 01 0A 01 00 01"	= "密碼認證";
"06 08 02 82 06 01 0A 01 00 02" = "被保護的密碼認證";
"06 08 02 82 06 01 0A 01 00 03" = "單向 X.509 認證";
"06 08 02 82 06 01 0A 01 00 04" = "雙向 X.509 認證";
"06 08 02 82 06 01 0A 01 00 05" = "三向 X.509 認證";
"06 08 02 82 06 01 0A 01 00 06" = "單向 ISO9798 認證";
"06 08 02 82 06 01 0A 01 00 07" = "雙向 ISO9798 認證";
"06 08 02 82 06 01 0A 01 00 08" = "Telekom 認證";

"06 07 02 82 06 01 0A 01 01"	= "Telesec 簽名";
"06 08 02 82 06 01 0A 01 01 01"	= "含 RSA 和 ISO9697 的 MD4";
"06 08 02 82 06 01 0A 01 01 02"	= "含 RSA 和 Telesec 簽名標準的 MD4";
"06 08 02 82 06 01 0A 01 01 03"	= "含 RSA 和 ISO9697 的 MD5";
"06 08 02 82 06 01 0A 01 01 04"	= "含 RSA 和 Telesec 簽名標準的 MD5";
"06 08 02 82 06 01 0A 01 01 05"	= "含 RSA 和 Telekom 簽名標準的 RIPEMD-160";
"06 08 02 82 06 01 0A 01 01 09"	= "HBCI RSA 簽名";

"06 07 02 82 06 01 0A 01 02"	= "Telesec 加密";
"06 08 02 82 06 01 0A 01 02 00"	= "無";
"06 08 02 82 06 01 0A 01 02 01"	= "RSA Telesec";
"06 08 02 82 06 01 0A 01 02 02"	= "DES";
"06 09 02 82 06 01 0A 01 02 02 01"	= "DES ECB";
"06 09 02 82 06 01 0A 01 02 02 02"	= "DES CBC";
"06 09 02 82 06 01 0A 01 02 02 03"	= "DES OFB";
"06 09 02 82 06 01 0A 01 02 02 04"	= "DES CFB8";
"06 09 02 82 06 01 0A 01 02 02 05"	= "DES CFB64";
"06 08 02 82 06 01 0A 01 02 03"	= "3DES";
"06 09 02 82 06 01 0A 01 02 03 01"	= "3DES ECB";
"06 09 02 82 06 01 0A 01 02 03 02"	= "3DES CBC";
"06 09 02 82 06 01 0A 01 02 03 03"	= "3DES OFB";
"06 09 02 82 06 01 0A 01 02 03 04"	= "3DES CFB8";
"06 09 02 82 06 01 0A 01 02 03 05"	= "3DES CFB64";
"06 08 02 82 06 01 0A 01 02 04"	= "Magenta";
"06 08 02 82 06 01 0A 01 02 05"	= "IDEA";
"06 09 02 82 06 01 0A 01 02 05 01"	= "IDEA ECB";
"06 09 02 82 06 01 0A 01 02 05 02"	= "IDEA CBC";
"06 09 02 82 06 01 0A 01 02 05 03"	= "IDEA OFB";
"06 09 02 82 06 01 0A 01 02 05 04"	= "IDEA CFB8";
"06 09 02 82 06 01 0A 01 02 05 05"	= "IDEA CFB64";

"06 07 02 82 06 01 0A 01 03"	= "單向功能";
"06 08 02 82 06 01 0A 01 03 01"	= "MD4";
"06 08 02 82 06 01 0A 01 03 02"	= "MD5";
"06 08 02 82 06 01 0A 01 03 03"	= "SqModN-X509";
"06 08 02 82 06 01 0A 01 03 04"	= "SqModN-ISO";
"06 08 02 82 06 01 0A 01 03 05"	= "RIPEMD-128";
"06 08 02 82 06 01 0A 01 03 06"	= "使用區塊編解碼的雜湊";
"06 08 02 82 06 01 0A 01 03 07"	= "MAC";
"06 08 02 82 06 01 0A 01 03 08"	= "RIPEMD-160";

"06 07 02 82 06 01 0A 01 04"	= "FEC 功能";
"06 08 02 82 06 01 0A 01 04 01"	= "Reed Solomon";

"06 06 02 82 06 01 0A 02"		= "Telesec 模組";
"06 07 02 82 06 01 0A 02 00"	= "演算法";
"06 07 02 82 06 01 0A 02 01"	= "屬性類型";
"06 07 02 82 06 01 0A 02 02"	= "憑證類型";
"06 07 02 82 06 01 0A 02 03"	= "訊息類型";
"06 07 02 82 06 01 0A 02 04"	= "PL 通訊協定";
"06 07 02 82 06 01 0A 02 05"	= "SME 和 SME 的組件";
"06 07 02 82 06 01 0A 02 06"	= "FEC";
"06 07 02 82 06 01 0A 02 07"	= "有用的定義";
"06 07 02 82 06 01 0A 02 08"	= "STE 檔案";
"06 07 02 82 06 01 0A 02 09"	= "SAdmin";
"06 07 02 82 06 01 0A 02 0A"	= "電子訂單";
"06 07 02 82 06 01 0A 02 0B"	= "Telesec TTP Asymmetric 應用程式";
"06 07 02 82 06 01 0A 02 0C"	= "Telesec TTP Basis 應用程式";
"06 07 02 82 06 01 0A 02 0D"	= "Telesec TTP 訊息";
"06 07 02 82 06 01 0A 02 0E"	= "Telesec TTP 時間戳記應用程式";

"06 06 02 82 06 01 0A 03"		= "物件類別";
"06 07 02 82 06 01 0A 03 00"	= "Telesec 其他名稱";
"06 07 02 82 06 01 0A 03 01"	= "目錄";
"06 07 02 82 06 01 0A 03 02"	= "目錄類型";
"06 07 02 82 06 01 0A 03 03"	= "目錄群組";
"06 07 02 82 06 01 0A 03 04"	= "目錄使用者";
"06 07 02 82 06 01 0A 03 05"	= "對稱密鑰輸入";

"06 06 02 82 06 01 0A 04"		= "套件";
"06 06 02 82 06 01 0A 05"		= "參數";
"06 06 02 82 06 01 0A 06"		= "名稱綁定";
"06 06 02 82 06 01 0A 07"		= "屬性";
"06 07 02 82 06 01 0A 07 00"	= "應用程式群組識別碼";
"06 07 02 82 06 01 0A 07 01"	= "憑證類型";
"06 07 02 82 06 01 0A 07 02"	= "Telesec 憑證";
"06 07 02 82 06 01 0A 07 03"	= "憑證編號";
"06 07 02 82 06 01 0A 07 04"	= "憑證撤銷列表";
"06 07 02 82 06 01 0A 07 05"	= "製作日期";
"06 07 02 82 06 01 0A 07 06"	= "簽發人";
"06 07 02 82 06 01 0A 07 07"	= "命名授權";
"06 07 02 82 06 01 0A 07 08"	= "公用密鑰目錄";
"06 07 02 82 06 01 0A 07 09"	= "安全性網域";
"06 07 02 82 06 01 0A 07 0A"	= "主題";
"06 07 02 82 06 01 0A 07 0B"	= "撤銷時間";
"06 07 02 82 06 01 0A 07 0C"	= "使用者群組基準";
"06 07 02 82 06 01 0A 07 0D"	= "有效性";
"06 07 02 82 06 01 0A 07 0E"	= "ZERT93";
"06 07 02 82 06 01 0A 07 0F"	= "安全性訊息環境";
"06 07 02 82 06 01 0A 07 10"	= "匿名公用密鑰目錄";
"06 07 02 82 06 01 0A 07 11"	= "Telesec 指定名稱";
"06 07 02 82 06 01 0A 07 12"	= "其他名稱";
"06 07 02 82 06 01 0A 07 13"	= "Telesec 郵遞區號";
"06 07 02 82 06 01 0A 07 14"	= "名稱辨識碼";
"06 07 02 82 06 01 0A 07 15"	= "Telesec 憑證列表";
"06 07 02 82 06 01 0A 07 16"	= "Teletrust 憑證列表";
"06 07 02 82 06 01 0A 07 17"	= "X.509 憑證列表";
"06 07 02 82 06 01 0A 07 18"	= "簽發時間";
"06 07 02 82 06 01 0A 07 19"	= "實體卡號";
"06 07 02 82 06 01 0A 07 1A"	= "檔案類型";
"06 07 02 82 06 01 0A 07 1B"	= "Ctl 檔案已歸檔";
"06 07 02 82 06 01 0A 07 1C"	= "電子郵件位址";
"06 07 02 82 06 01 0A 07 1D"	= "憑證樣板列表";
"06 07 02 82 06 01 0A 07 1E"	= "目錄名稱";
"06 07 02 82 06 01 0A 07 1F"	= "目錄類型名稱";
"06 07 02 82 06 01 0A 07 20"	= "目錄群組名稱";
"06 07 02 82 06 01 0A 07 21"	= "目錄使用者名稱";
"06 07 02 82 06 01 0A 07 22"	= "撤銷旗標";
"06 07 02 82 06 01 0A 07 23"	= "對稱密鑰輸入名稱";
"06 07 02 82 06 01 0A 07 24"	= "GL 編號";
"06 07 02 82 06 01 0A 07 25"	= "GO 編號";
"06 07 02 82 06 01 0A 07 26"	= "G 密鑰資料";
"06 07 02 82 06 01 0A 07 27"	= "Z 密鑰資料";
"06 07 02 82 06 01 0A 07 28"	= "KT 密鑰資料";
"06 07 02 82 06 01 0A 07 2A"	= "KT 密鑰編號";
"06 07 02 82 06 01 0A 07 33"	= "撤銷發生時間";
"06 07 02 82 06 01 0A 07 34"	= "責任文字";

"06 06 02 82 06 01 0A 08"		= "屬性群組";
"06 06 02 82 06 01 0A 09"		= "動作";
"06 06 02 82 06 01 0A 0A"		= "通知";
"06 06 02 82 06 01 0A 0B"		= "SNMP-MIBS";

"06 07 02 82 06 01 0A 0B 01"	= "安全性應用程式";

"06 06 02 82 06 01 0A 0C"		= "憑證和 CRL 延伸功能定義";

"06 07 02 82 06 01 0A 0C 00"	= "憑證延伸責任限制擴展";
"06 07 02 82 06 01 0A 0C 01"	= "Telesec 憑證識別碼延伸功能";
"06 07 02 82 06 01 0A 0C 02"	= "Telesec 規則識別碼";
"06 07 02 82 06 01 0A 0C 03"	= "Telesec 規則辨識符號識別碼";
"06 07 02 82 06 01 0A 0C 04"	= "經 Telesec CRL 過濾的延伸功能";
"06 07 02 82 06 01 0A 0C 05"	= "Telesec CRL 過濾延伸功能";
"06 07 02 82 06 01 0A 0C 06"	= "Telesec 命名授權延伸功能";

/* RFC 1274 (X.500 attribute collection from the UK, thus the weird OID). */

"06 0A 09 92 26 89 93 F2 2C 64 01 01"	= "使用者識別碼";
"06 0A 09 92 26 89 93 F2 2C 64 01 03"	= "RFC822 信箱";

/* RFC 2247 */

"06 0A 09 92 26 89 93 F2 2C 64 01 19"	= "網域組件";

/* Australian Government */

"06 06 2A 24 01 82 4D 01"   = "澳洲商業編號";

/* Certificates Australia */

"06 0A 2A 24 A4 97 A3 53 01 64 01 01"	= "憑證的澳洲規則識別碼";

/* Signet */

"06 09 2A 24 A0 F2 A0 7D 01 01 02"	= "Signet Personal";
"06 09 2A 24 A0 F2 A0 7D 01 01 03"	= "Signet Business";
"06 09 2A 24 A0 F2 A0 7D 01 01 04"	= "Signet Legal";
"06 09 2A 24 A0 F2 A0 7D 01 01 0A"	= "Signet Pilot";
"06 09 2A 24 A0 F2 A0 7D 01 01 0B"	= "Signet IntraNet";
"06 09 2A 24 A0 F2 A0 7D 01 01 14"	= "Signet 規則識別碼";

/* Mitsubishi */

"06 0B 2A 83 08 8C 1A 4B 3D 01 01 01"		= "對稱加密演算法";
"06 0C 2A 83 08 8C 9A 4B 3D 01 01 01 01"	= "MISTY1-CBC";

/* SEIS */

"06 05 2A 85 70 22 01"		= "SEIS CP";
"06 06 2A 85 70 22 01 01"	= "SEIS 高保障規則識別碼";
"06 06 2A 85 70 22 01 02"	= "SEIS GAK 規則識別碼";
"06 05 2A 85 70 22 02"		= "SEIS PE";
"06 05 2A 85 70 22 03"		= "SEIS AT";
"06 06 2A 85 70 22 03 01"	= "SEIS AT 個人識別碼";

/* ANSI X9.57 */

"06 06 2A 86 48 CE 38 01"		= "ANSI X9.57 模組";
"06 07 2A 86 48 CE 38 01 01"	= "X9F1 憑證管理";
"06 06 2A 86 48 CE 38 02"		= "保留指令";
"06 07 2A 86 48 CE 38 02 01"	= "保留指令－無";
"06 07 2A 86 48 CE 38 02 02"	= "撥號簽發人";
"06 07 2A 86 48 CE 38 02 03"	= "拒絕";
"06 07 2A 86 48 CE 38 02 04"	= "挑選代號";
"06 06 2A 86 48 CE 38 03"		= "屬性";
"06 06 2A 86 48 CE 38 03 01"	= "副署";
"06 06 2A 86 48 CE 38 03 02"	= "屬性憑證";
"06 06 2A 86 48 CE 38 04"		= "演算法";
"06 07 2A 86 48 CE 38 04 01"	= "DSA";
"06 07 2A 86 48 CE 38 04 02"	= "DSA 符合";
"06 07 2A 86 48 CE 38 04 03"	= "含 SHA-1 的 DSA";

/* ANSI X9.62 */

"06 06 2A 86 48 CE 3D 01"		= "ANSI X9.62 欄位類型";
"06 07 2A 86 48 CE 3D 01 01"	= "首要欄位";
"06 07 2A 86 48 CE 3D 01 02"	= "特徵二欄位";
"06 09 2A 86 48 CE 3D 01 02 03"	= "特徵二基準";
"06 0A 2A 86 48 CE 3D 01 02 03 01"	= "Null 基準";
"06 0A 2A 86 48 CE 3D 01 02 03 02"	= "三項式基準";
"06 0A 2A 86 48 CE 3D 01 02 03 03"	= "五項式基準";
"06 06 2A 86 48 CE 3D 02"		= "公用密鑰類型";
"06 07 2A 86 48 CE 3D 02 01"	= "橢圓曲線公用密鑰";

/* ANSI X9.42 */

"06 06 2A 86 48 CE 3E 01"		= "ANSI X9.42 欄位類型";
"06 07 2A 86 48 CE 3E 01 01"	= "Galois 欄位首";
"06 06 2A 86 48 CE 3E 02"		= "編號類型";
"06 07 2A 86 48 CE 3E 02 01"	= "Diffie-Hellman 公用密鑰";
"06 06 2A 86 48 CE 3E 03"		= "架構";
"06 07 2A 86 48 CE 3E 03 01"	= "Diffie-Hellman 統計";
"06 07 2A 86 48 CE 3E 03 02"	= "Diffie-Hellman 暫時";
"06 07 2A 86 48 CE 3E 03 03"	= "Diffie-Hellman 融合 1";
"06 07 2A 86 48 CE 3E 03 04"	= "Diffie-Hellman 融合 2";
"06 07 2A 86 48 CE 3E 03 05"	= "MQV2";
"06 07 2A 86 48 CE 3E 03 06"	= "MQV1";

/* Nortel Secure Networks/Entrust */

"06 07 2A 86 48 86 F6 7D 07"		= "NSN";
"06 08 2A 86 48 86 F6 7D 07 41"		= "NSN-CE";
"06 09 2A 86 48 86 F6 7D 07 41 00"	= "Entrust 版本簡介";
"06 08 2A 86 48 86 F6 7D 07 42"		= "NSN-Alg";
"06 09 2A 86 48 86 F6 7D 07 42 03"	= "CAST3-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0A"	= "CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0B"	= "CAST5-MAC";
"06 09 2A 86 48 86 F6 7D 07 42 0C"	= "含 MD5 和 CAST5-CBC 的 PBE";
"06 09 2A 86 48 86 F6 7D 07 42 0D"	= "密碼基準 MAC";
"06 08 2A 86 48 86 F6 7D 07 43"		= "NSN-OC";
"06 09 2A 86 48 86 F6 7D 07 43 0C"	= "Entrust 使用者";
"06 08 2A 86 48 86 F6 7D 07 44"		= "NSN-AT";
"06 09 2A 86 48 86 F6 7D 07 44 00"	= "Entrust CA 簡介";
"06 09 2A 86 48 86 F6 7D 07 44 0A"	= "屬性憑證";

/* PKCS #1 */

"06 08 2A 86 48 86 F7 0D 01 01"		= "PKCS-1";
"06 09 2A 86 48 86 F7 0D 01 01 01"	= "RSA 加密";
"06 09 2A 86 48 86 F7 0D 01 01 02"	= "含 RSA 加密的 MD2";
"06 09 2A 86 48 86 F7 0D 01 01 03"	= "含 RSA 加密的 MD4";
"06 09 2A 86 48 86 F7 0D 01 01 04"	= "含 RSA 加密的 MD5";
"06 09 2A 86 48 86 F7 0D 01 01 05"	= "含 RSA 加密的 SHA-1";
"06 09 2A 86 48 86 F7 0D 01 01 06"	= "RSA-OAEP 加密（SET）";
"06 09 2A 86 48 86 F7 0D 01 01 07"	= "RSA-OAEP 加密";
"06 09 2A 86 48 86 F7 0D 01 01 08"	= "RSA-OAEP-MGF";
"06 09 2A 86 48 86 F7 0D 01 01 09"	= "指定的 RSA-OAEP 標籤";
"06 09 2A 86 48 86 F7 0D 01 01 0A"	= "RSA-PSS 簽名架構";
"06 09 2A 86 48 86 F7 0D 01 01 0B"	= "含 RSA 加密的 SHA-256";
"06 09 2A 86 48 86 F7 0D 01 01 0C"	= "含 RSA 加密的 SHA-384";
"06 09 2A 86 48 86 F7 0D 01 01 0D"	= "含 RSA 加密的 SHA-512";
"06 09 2A 86 48 86 F7 0D 01 01 0E"	= "含 RSA 加密的 SHA-224";

/* BSAFE/PKCS #2 (obsolete) */

"06 08 2A 86 48 86 F7 0D 01 02"		= "BSAFE RSA 加密";

/* PKCS #3 */

"06 08 2A 86 48 86 F7 0D 01 03"		= "PKCS-3";
"06 09 2A 86 48 86 F7 0D 01 03 01"	= "Diffie-Hellman 密鑰協定";

/* PKCS #5 */

"06 08 2A 86 48 86 F7 0D 01 05"		= "PKCS-5";
"06 09 2A 86 48 86 F7 0D 01 05 01"	= "含 MD2 和 DES-CBC 的 PBE";
"06 09 2A 86 48 86 F7 0D 01 05 03"	= "含 MD5 和 DES-CBC 的 PBE";
"06 09 2A 86 48 86 F7 0D 01 05 04"	= "含 MD2 和 RC2-CBC 的 PBE";
"06 09 2A 86 48 86 F7 0D 01 05 06"	= "含 MD5 和 RC2-CBC 的 PBE";
"06 09 2A 86 48 86 F7 0D 01 05 09"	= "含 MD5 和 XOR 的 PBE";
"06 09 2A 86 48 86 F7 0D 01 05 0A"	= "含 SHA 和 DES-CBC 的 PBE";
"06 09 2A 86 48 86 F7 0D 01 05 0C"	= "PKCS-5 PBKDF2";
"06 09 2A 86 48 86 F7 0D 01 05 0D"	= "PKCS-5 PBES2";
"06 09 2A 86 48 86 F7 0D 01 05 0E"	= "PKCS-5 PBMAC1";

/* PKCS #7 */

"06 08 2A 86 48 86 F7 0D 01 07"		= "PKCS-7";
"06 09 2A 86 48 86 F7 0D 01 07 01"	= "資料";
"06 09 2A 86 48 86 F7 0D 01 07 02"	= "已簽名資料";
"06 09 2A 86 48 86 F7 0D 01 07 03"	= "封裝好的資料";
"06 09 2A 86 48 86 F7 0D 01 07 04"	= "已簽名封裝的資料";
"06 09 2A 86 48 86 F7 0D 01 07 05"	= "摘要資訊";
"06 09 2A 86 48 86 F7 0D 01 07 06"	= "加密的資料";
"06 09 2A 86 48 86 F7 0D 01 07 07"	= "含屬性的資料";
"06 09 2A 86 48 86 F7 0D 01 07 08"	= "加密的專用密鑰簡介";

/* PKCS #9 */

"06 08 2A 86 48 86 F7 0D 01 09"		= "PKCS-9";
"06 09 2A 86 48 86 F7 0D 01 09 01"	= "電子郵件位址";
"06 09 2A 86 48 86 F7 0D 01 09 02"	= "未架構的名稱";
"06 09 2A 86 48 86 F7 0D 01 09 03"	= "內容類型";
"06 09 2A 86 48 86 F7 0D 01 09 04"	= "訊息摘要";
"06 09 2A 86 48 86 F7 0D 01 09 05"	= "簽名時間";
"06 09 2A 86 48 86 F7 0D 01 09 06"	= "副署";
"06 09 2A 86 48 86 F7 0D 01 09 07"	= "詢問的密碼";
"06 09 2A 86 48 86 F7 0D 01 09 08"	= "未架構的地址";
"06 09 2A 86 48 86 F7 0D 01 09 09"	= "延伸的憑證屬性";
"06 09 2A 86 48 86 F7 0D 01 09 0A"	= "簽發人和序號";
"06 09 2A 86 48 86 F7 0D 01 09 0B"	= "密碼核對";
"06 09 2A 86 48 86 F7 0D 01 09 0C"	= "公用密鑰";
"06 09 2A 86 48 86 F7 0D 01 09 0D"	= "簽名描述";
"06 09 2A 86 48 86 F7 0D 01 09 0E"	= "延伸要求";

/* PKCS #9 for use with S/MIME */

"06 09 2A 86 48 86 F7 0D 01 09 0F"		= "S/MIME 功能";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 01"	= "簽名資料優先";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 02"	= "不能再解密";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 03"	= "接受要求";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 04"	= "接受";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 05"	= "內容提示";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 06"	= "郵件列表擴充總覽";

"06 09 2A 86 48 86 F7 0D 01 09 10"			= "S/MIME";

/* S/MIME Modules */

"06 0A 2A 86 48 86 F7 0D 01 09 10 00"		= "S/MIME 模組";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 01"	= "加解密訊息語法";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 02"	= "增強的安全性服務";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 03"	= "S/MIME 目標識別碼";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 04"	= "S/MIME V3 訊息";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 05"	= "ETS 電子簽名 88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 06"	= "ETS 電子簽名 97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 07"	= "ETS 電子簽名規則 88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 08"	= "ETS 電子簽名規則 97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 09"	= "id-mod-certdist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0A"	= "id-mod-domsec";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0B"	= "id-mod-compress";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0C"	= "id-mod-symkeydist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0D"	= "id-mod-cek-reuse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0E"	= "id-mod-cms-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0F"	= "id-mod-v1AttrCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 10"	= "id-mod-cmsalg-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 11"	= "id-mod-cms-pwri-88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 12"	= "id-mod-cms-pwri-97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 13"	= "id-mod-cms-aes";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 14"	= "id-mod-cms-rsaes-oaep";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 15"	= "id-mod-msg-v3dot1";

/* S/MIME Content Types */

"06 0A 2A 86 48 86 F7 0D 01 09 10 01"		= "S/MIME 內容類型";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 01"	= "id-ct-receipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 02"	= "id-ct-authData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 03"	= "id-ct-publishCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 04"	= "id-ct-TSTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 05"	= "id-ct-TDTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 06"	= "id-ct-contentInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 07"	= "id-ct-DVCSRequestData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 08"	= "id-ct-DVCSResponseData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 09"	= "id-ct-compressedData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0A"	= "id-ct-svcp-certValRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0B"	= "id-ct-svcp-certValResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0C"	= "id-ct-svcp-valPolRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0D"	= "id-ct-svcp-valPolResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0E"	= "id-ct-attrCertEncAttrs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0F"	= "id-ct-TSReq";

/* S/MIME Authenticated Attributes */

"06 0A 2A 86 48 86 F7 0D 01 09 10 02"		= "S/MIME 認證的屬性";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 01"	= "id-aa-receiptRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 02"	= "id-aa-securityLabel";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 03"	= "id-aa-mlExpandHistory";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 04"	= "id-aa-contentHint";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 05"	= "id-aa-msgSigDigest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 06"	= "id-aa-encapContentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 07"	= "id-aa-contentIdentifier";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 08"	= "id-aa-macValue";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 09"	= "id-aa-equivalentLabels";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0A"	= "id-aa-contentReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0B"	= "id-aa-encrypKeyPref";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0C"	= "id-aa-signingCertificate";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0D"	= "id-aa-smimeEncryptCerts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0E"	= "id-aa-timeStampToken";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0F"	= "id-aa-ets-sigPolicyId";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 10"	= "id-aa-ets-commitmentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 11"	= "id-aa-ets-signerLocation";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 12"	= "id-aa-ets-signerAttr";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 13"	= "id-aa-ets-otherSigCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 14"	= "id-aa-ets-contentTimestamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 15"	= "id-aa-ets-CertificateRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 16"	= "id-aa-ets-RevocationRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 17"	= "id-aa-ets-certValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 18"	= "id-aa-ets-revocationValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 19"	= "id-aa-ets-escTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1A"	= "id-aa-ets-certCRLTimestamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1B"	= "id-aa-ets-archiveTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1C"	= "id-aa-signatureType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1D"	= "id-aa-dvcs-dvc";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1E"	= "id-aa-CEKReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1F"	= "id-aa-maxCEKDecrypts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 20"	= "id-aa-KEKDerivationAlg";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 21"	= "id-aa-intendedRecipients";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 22"	= "id-aa-cmc-unsignedData";

/* S/MIME Algorithms */

"06 0A 2A 86 48 86 F7 0D 01 09 10 03"		= "S/MIME 演算法";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 01"	= "id-alg-ESDHwith3DES";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 02"	= "id-alg-ESDHwithRC2";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 03"	= "id-alg-3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 04"	= "id-alg-RC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 05"	= "id-alg-ESDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 06"	= "id-alg-CMS3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 07"	= "id-alg-CMSRC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 08"	= "id-alg-zlib";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 09"	= "id-alg-PWRI-KEK";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0A"	= "id-alg-SSDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0B"	= "id-alg-HMACwith3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0C"	= "id-alg-HMACwithAESwrap";

/* S/MIME Certificate Distribution */

"06 0A 2A 86 48 86 F7 0D 01 09 10 04"		= "S/MIME 憑證分配";
"06 0B 2A 86 48 86 F7 0D 01 09 10 04 01"	= "LDAP 憑證分配";

/* S/MIME Signature Policy Qualifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 05"		= "S/MIME 簽名規則辨識符號";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 01"	= "id-spq-ets-sqt-uri";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 02"	= "id-spq-ets-sqt-unotice";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 01"	= "id-cti-ets-proofOfOrigin";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 02"	= "id-cti-ets-proofOfReceipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 03"	= "id-cti-ets-proofOfDelivery";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 04"	= "id-cti-ets-proofOfSender";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 05"	= "id-cti-ets-proofOfApproval";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 06"	= "id-cti-ets-proofOfCreation";

/* S/MIME Signature Type Identifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 09"		= "S/MIME 簽名類型識別碼";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 01"	= "創始人簽名";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 02"	= "網域簽名";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 03"	= "附加的屬性簽名";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 04"	= "複查簽名";

/* S/MIME Capabilities */

"06 0A 2A 86 48 86 F7 0D 01 09 10 0B"		= "S/MIME 功能";
"06 0B 2A 86 48 86 F7 0D 01 09 10 0B 01"	= "內部優先二進位";

/* PKCS #9 for use with PKCS #12 */

"06 09 2A 86 48 86 F7 0D 01 09 14"			= "較易讀取名稱（PKCS-12 適用）";
"06 09 2A 86 48 86 F7 0D 01 09 15"			= "本機密鑰識別碼（PKCS-12 適用）";
"06 09 2A 86 48 86 F7 0D 01 09 16"			= "憑證類型（PKCS-12 適用）";
"06 0A 2A 86 48 86 F7 0D 01 09 16 01"		= "X.509 憑證（PKCS-12 適用）";
"06 0A 2A 86 48 86 F7 0D 01 09 16 02"		= "SDSI 憑證（PKCS-12 適用）";
"06 09 2A 86 48 86 F7 0D 01 09 17"			= "CRL 類型（PKCS-12 適用）";
"06 0A 2A 86 48 86 F7 0D 01 09 17 01"		= "X.509 CRL（PKCS-12 適用）";

/* PKCS #12 */

"06 08 2A 86 48 86 F7 0D 01 0C"				= "PKCS-12 個人資訊交換語法";
"06 09 2A 86 48 86 F7 0D 01 0C 01"			= "PKCS-12 密碼基準加密識別碼";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 01"		= "含 SHA-1 和 128 位元 RC4 的 PBE";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 02"		= "含 SHA-1 和 40 位元 RC4 的 PBE";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 03"		= "含 SHA-1 和 3-Key Triple DES-CBC 的 PBE";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 04"		= "含 SHA-1 和 2-Key Triple DES-CBC 的 PBE";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 05"		= "含 SHA-1 和 128 位元 RC2-CBC 的 PBE";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 06"		= "含 SHA-1 和 40 位元 RC2-CBC 的 PBE";
"06 09 2A 86 48 86 F7 0D 01 0C 02"			= "PKCS-12 ESPVK 識別碼";
"06 0A 2A 86 48 86 F7 0D 01 0C 02 01"		= "PKCS-12 PKCS-8 密鑰屏蔽";
"06 09 2A 86 48 86 F7 0D 01 0C 03"			= "PKCS-12 Bag 識別碼";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 01"		= "PKCS-12 密鑰 Bag 識別碼";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 02"		= "PKCS-12 憑證和 CRL Bag 識別碼";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 03"		= "PKCS-12 機密 Bag 識別碼";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 04"		= "PKCS-12 安全內容識別碼";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 05"		= "PKCS-12 PKCS-8 屏蔽密鑰 Bag 識別碼";
"06 09 2A 86 48 86 F7 0D 01 0C 04"			= "PKCS-12 憑證 Bag 識別碼";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 01"		= "PKCS-12 X.509 憑證和 CRL Bag 識別碼";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 02"		= "PKCS-12 SDSI 憑證 Bag 識別碼";

"06 09 2A 86 48 86 F7 0D 01 0C 05"			= "PKCS-12 OID";
"06 0A 2A 86 48 86 F7 0D 01 0C 05 01"		= "PKCS-12 密碼基準加密識別碼";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 01"	= "含 SHA-1 和 128 位元 RC4 的 PKCS-12 PBE ";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 02"	= "含 SHA-1 和 40 位元 RC4 的 PKCS-12 PBE";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 03"	= "含 SHA-1 和 Triple DES-CBC 的 PKCS-12 PBE";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 04"	= "含 SHA-1 和 128 位元 RC2-CBC 的 PKCS-12 PBE";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 05"	= "含 SHA-1 和 40 位元 RC2-CBC 的 PKCS-12 PBE";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 06"	= "含 SHA-1 和 RC4 的 PKCS-12 PBE ";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 07"	= "含 SHA-1 和 RC2-CBC 的 PKCS-12 PBE";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 02"		= "PKCS-12 封裝識別碼";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 01"	= "含 128 位元 RC4 的 PKCS-12 RSA 加密";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 02"	= "含 40 位元 RC4 的 PKCS-12 RSA 加密";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 03"	= "含 Triple DES 的 PKCS-12 RSA 加密";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 03"		= "PKCS-12 簽名識別碼";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 03 01"	= "含 SHA-1 分類的 PKCS-12 RSA 簽名";

"06 09 2A 86 48 86 F7 0D 01 0C 0A"			= "PKCS-12 版本 1";
"06 0A 2A 86 48 86 F7 0D 01 0C 0A 01"		= "PKCS-12 Bag 識別碼";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 01"	= "PKCS-12 密鑰 Bag";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 02"	= "PKCS-12 PKCS-8 屏蔽密鑰 Bag";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 03"	= "PKCS-12 憑證 Bag";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 04"	= "PKCS-12 CRL Bag";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 05"	= "PKCS-12 機密 Bag";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 06"	= "PKCS-12 安全內容 Bag";

/* PKCS #15 */

"06 09 2A 86 48 86 F7 0D 01 0F 01"		= "PKCS-15 模組";
"06 09 2A 86 48 86 F7 0D 01 0F 02"		= "PKCS-15 屬性";
"06 09 2A 86 48 86 F7 0D 01 0F 03"		= "PKCS-15 內容類型";
"06 0A 2A 86 48 86 F7 0D 01 0F 03 01"	= "PKCS-15 內容";

/* RSADSI digest algorithms */

"06 08 2A 86 48 86 F7 0D 02"			= "RSADSI 摘要演算法";
"06 08 2A 86 48 86 F7 0D 02 02"			= "MD2";
"06 08 2A 86 48 86 F7 0D 02 04"			= "MD4";
"06 08 2A 86 48 86 F7 0D 02 05"			= "MD5";
"06 08 2A 86 48 86 F7 0D 02 07"			= "含 SHA-1 的 HMAC";

/* RSADSI encryption algorithms */

"06 08 2A 86 48 86 F7 0D 03"			= "RSADSI 加密演算法";
"06 08 2A 86 48 86 F7 0D 03 02"			= "RC2-CBC";
"06 08 2A 86 48 86 F7 0D 03 03"			= "RC2-ECB";
"06 08 2A 86 48 86 F7 0D 03 04"			= "RC4";
"06 08 2A 86 48 86 F7 0D 03 05"			= "含 MAC 的 RC4";
"06 08 2A 86 48 86 F7 0D 03 06"			= "DESX-CBC";
"06 08 2A 86 48 86 F7 0D 03 07"			= "DES-EDE3-CBC";
"06 08 2A 86 48 86 F7 0D 03 08"			= "RC5-CBC";
"06 08 2A 86 48 86 F7 0D 03 09"			= "RC5-CBC Pad";
"06 08 2A 86 48 86 F7 0D 03 0A"			= "DES-CDMF";

/* Identrus */

"06 09 2A 86 48 86 FA 65 01 06 01"		= "Identrus 未知規則識別碼";
"06 08 2A 86 48 86 FA 65 04 01"			= "Identrus OCSP";

/* Ascom Systech */

"06 0A 2B 06 01 04 01 81 3C 07 01 01"		= "Ascom";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 01"	= "IDEA-ECB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 02"	= "IDEA-CBC";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 03"	= "IDEA-CFB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 04"	= "IDEA-OFB";

/* MIT */

"06 09 2A 86 48 86 F7 12 01 02 02"			= "MIT Kerberos V5";
"06 0A 2A 86 48 86 F7 12 01 02 02 03"		= "MIT 使用者對使用者 Kerberos";

/* Microsoft */

"06 09 2A 86 48 82 F7 12 01 02 02"			= "Microsoft Kerberos";

"06 08 2A 86 48 86 F7 14 01 03"				= "Microsoft Exchange Server 物件類別";
"06 09 2A 86 48 86 F7 14 01 03 00"			= "站台定址";
"06 09 2A 86 48 86 F7 14 01 03 0D"			= "類比描述語言";
"06 09 2A 86 48 86 F7 14 01 03 0E"			= "屬性描述語言";
"06 09 2A 86 48 86 F7 14 01 03 11"			= "信箱代理程式";
"06 09 2A 86 48 86 F7 14 01 03 16"			= "信箱";
"06 09 2A 86 48 86 F7 14 01 03 17"			= "容器";
"06 09 2A 86 48 86 F7 14 01 03 2E"			= "郵件收件人";
"06 09 2A 86 48 86 F7 14 01 02 81 71"		= "寄送機制";

"06 07 2A 86 48 86 F7 14 04"				= "Microsoft 檔案格式";
"06 08 2A 86 48 86 F7 14 04 02"				= "Microsoft Word";
"06 08 2A 86 48 86 F7 14 04 03"				= "Microsoft Excel";
"06 08 2A 86 48 86 F7 14 04 04"				= "Microsoft Project";
"06 08 2A 86 48 86 F7 14 04 05"				= "Microsoft PowerPoint";
"06 08 2A 86 48 86 F7 14 04 06"				= "Microsoft Works";

"06 08 2B 06 01 04 01 82 37 02"				= "Authenticode";
"06 0A 2B 06 01 04 01 82 37 02 01 04"		= "SPC 間接資料環境";
"06 0A 2B 06 01 04 01 82 37 02 01 0A"		= "SPC 代理簡介";
"06 0A 2B 06 01 04 01 82 37 02 01 0B"		= "SPC 語句類型";
"06 0A 2B 06 01 04 01 82 37 02 01 0C"		= "SPC Opus 簡介";
"06 0A 2B 06 01 04 01 82 37 02 01 0E"		= "SPC 憑證延伸功能";
"06 0A 2B 06 01 04 01 82 37 02 01 0F"		= "SPC PE 圖像資料";
"06 0A 2B 06 01 04 01 82 37 02 01 14"		= "SPC 連結（類型 1）";
"06 0A 2B 06 01 04 01 82 37 02 01 15"		= "單獨的代碼簽名";
"06 0A 2B 06 01 04 01 82 37 02 01 16"		= "商業代碼簽名";
"06 0A 2B 06 01 04 01 82 37 02 01 19"		= "SPC 連結（類型 2）";
"06 0A 2B 06 01 04 01 82 37 02 01 1A"		= "SPC 最小標準";
"06 0A 2B 06 01 04 01 82 37 02 01 1B"		= "SPC 金融標準";
"06 0A 2B 06 01 04 01 82 37 02 01 1C"		= "SPC 連結（類型 3）";

"06 0A 2B 06 01 04 01 82 37 02 02 0A"		= "NTLM 安全性支援供應商";
"06 0A 2B 06 01 04 01 82 37 03 02 01"		= "時間戳記副署";

"06 09 2B 06 01 04 01 82 37 0A 01"			= "憑證信任列表";
"06 0A 2B 06 01 04 01 82 37 0A 01 01"		= "分類的 CTL 延伸功能";
"06 09 2B 06 01 04 01 82 37 0A 02"			= "下一個更新位置";

"06 09 2B 06 01 04 01 82 37 0A 03"			= "增強的密鑰用途";
"06 0A 2B 06 01 04 01 82 37 0A 03 01"		= "憑證信任列表簽名";
"06 0A 2B 06 01 04 01 82 37 0A 03 02"		= "時間戳記簽名";
"06 0A 2B 06 01 04 01 82 37 0A 03 03"		= "伺服器通道加密";
"06 0B 2B 06 01 04 01 82 37 0A 03 03 01"	= "序列化加密";
"06 0A 2B 06 01 04 01 82 37 0A 03 04"		= "加密的檔案系統";
"06 0B 2B 06 01 04 01 82 37 0A 03 04 01"	= "加密的檔案系統恢復";
"06 0A 2B 06 01 04 01 82 37 0A 03 05"		= "Windows 硬體相容";
"06 0A 2B 06 01 04 01 82 37 0A 03 06"		= "NT5 簽名";
"06 0A 2B 06 01 04 01 82 37 0A 03 07"		= "Windows 硬體 OEM 簽名";
"06 0A 2B 06 01 04 01 82 37 0A 03 08"		= "嵌入的 NT 簽名";
"06 0A 2B 06 01 04 01 82 37 0A 03 09"		= "受信任的根列表簽名";
"06 0A 2B 06 01 04 01 82 37 0A 03 0A"		= "合格的從屬關係";
"06 0A 2B 06 01 04 01 82 37 0A 03 0B"		= "密鑰恢復";
"06 0A 2B 06 01 04 01 82 37 0A 03 0C"		= "文件簽名";

"06 09 2B 06 01 04 01 82 37 0A 04"			= "屬性目標識別碼";
"06 0A 2B 06 01 04 01 82 37 0A 04 01"		= "是/否信任屬性";
"06 0A 2B 06 01 04 01 82 37 0A 05 01"		= "Microsoft 音樂 DRM";
"06 0A 2B 06 01 04 01 82 37 0A 05 02"		= "Microsoft DRM 差別";
"06 0A 2B 06 01 04 01 82 37 0A 06 01"		= "Microsoft 授權";
"06 0A 2B 06 01 04 01 82 37 0A 06 02"		= "Microsoft 授權伺服器";

"06 08 2B 06 01 04 01 82 37 0D"				= "Microsoft PKCS-10 目標識別碼";
"06 09 2B 06 01 04 01 82 37 0D 01"			= "更新的憑證";
"06 0A 2B 06 01 04 01 82 37 0D 02 01"		= "登記姓名/數值配對";
"06 0A 2B 06 01 04 01 82 37 0D 02 02"		= "登記 CSP";
"06 0A 2B 06 01 04 01 82 37 0D 02 03"		= "OS 版本";
"06 08 2B 06 01 04 01 82 37 0F"				= "Microsoft Java";
"06 08 2B 06 01 04 01 82 37 10"				= "Microsoft Outlook/Exchange";
"06 09 2B 06 01 04 01 82 37 10 04"			= "Microsoft Outlook Express";
"06 08 2B 06 01 04 01 82 37 11"				= "Microsoft PKCS-12 屬性";
"06 09 2B 06 01 04 01 82 37 11 01"			= "本機機器密鑰集";

"06 08 2B 06 01 04 01 82 37 14"				= "Microsoft 登記基礎架構";
"06 09 2B 06 01 04 01 82 37 14 01"			= "自動登記 CTL 用途";
"06 09 2B 06 01 04 01 82 37 14 02"			= "登記憑證類型";
"06 0A 2B 06 01 04 01 82 37 14 02 01"		= "登記代理程式";
"06 0A 2B 06 01 04 01 82 37 14 02 02"		= "智慧卡登錄";
"06 0A 2B 06 01 04 01 82 37 14 02 03"		= "NT 主要名稱";

"06 08 2B 06 01 04 01 82 37 15"				= "Microsoft 憑證伺服器基礎架構";
"06 09 2B 06 01 04 01 82 37 15 01"			= "Microsoft CA 更新的版本";
"06 08 2B 06 01 04 01 82 37 58"				= "CAPICOM";
"06 09 2B 06 01 04 01 82 37 58 01"			= "CAPICOM 版本";
"06 09 2B 06 01 04 01 82 37 58 02"			= "CAPICOM 屬性";
"06 0A 2B 06 01 04 01 82 37 58 02 01"		= "文件名稱";
"06 0A 2B 06 01 04 01 82 37 58 02 02"		= "文件描述";
"06 09 2B 06 01 04 01 82 37 58 03"			= "加密的資料";
"06 0A 2B 06 01 04 01 82 37 58 03 01"		= "加密內容";

/* UNINETT */

"06 0A 2B 06 01 04 01 92 7C 0A 01 01"		= "UNINETT 規則識別碼";

/* ICE-TEL */

"06 08 2B 06 01 04 01 95 18 0A"				= "ICE-TEL 規則識別碼";
"06 0A 2B 06 01 04 01 95 62 01 01 01"		= "ICE-TEL CA 規則識別碼";

/* cryptlib */

"06 0A 2B 06 01 04 01 97 55 01 01 01"		= "Blowfish-ECB";
"06 0A 2B 06 01 04 01 97 55 01 01 02"		= "Blowfish-CBC";
"06 0A 2B 06 01 04 01 97 55 01 01 03"		= "Blowfish-CFB";
"06 0A 2B 06 01 04 01 97 55 01 01 04"		= "Blowfish-OFB";
"06 0A 2B 06 01 04 01 97 55 01 02 01"		= "ElGamal";
"06 0B 2B 06 01 04 01 97 55 01 02 01 01"	= "含 SHA-1 的 ElGamal";
"06 0B 2B 06 01 04 01 97 55 01 02 01 02"	= "含 RIPEMD-160 的 ElGamal";
"06 09 2B 06 01 04 01 97 55 03 01"			= "cryptlib 屬性";
"06 0A 2B 06 01 04 01 97 55 03 01 01"		= "cryptlib 存在檢查";
"06 0A 2B 06 01 04 01 97 55 03 01 02"		= "OCSP 回應 RTCS";
"06 0A 2B 06 01 04 01 97 55 03 01 03"		= "延伸的 OCSP 回應 RTCS";
"06 0A 2B 06 01 04 01 97 55 03 01 04"		= "CRL 延伸的原因";
"06 0A 2B 06 01 04 01 97 55 03 01 05"		= "密鑰功能";
"06 0A 2B 06 01 04 01 97 55 03 01 06"		= "PKI Boot";
"06 09 2B 06 01 04 01 97 55 04 01"			= "cryptlib 內容";
"06 0A 2B 06 01 04 01 97 55 04 01 01"		= "cryptlib 設定資料";
"06 0A 2B 06 01 04 01 97 55 04 01 02"		= "cryptlib 使用者索引";
"06 0A 2B 06 01 04 01 97 55 04 01 03"		= "cryptlib 使用者簡介";
"06 0B 2B 06 01 04 01 97 55 2A D7 24 01"	= "MPEG-1";
"06 0C 2B 06 01 04 01 97 55 58 59 5A 5A 59"	= "XYZZY 規則識別碼";

/* Timeproof (www.timeproof.de) */

"06 07 2B 06 01 04 01 AA 60"		= "耐久的";
"06 08 2B 06 01 04 01 AA 60 01"		= "時間簽名系統";
"06 09 2B 06 01 04 01 AA 60 01 01"	= "時間簽名系統 80";
"06 09 2B 06 01 04 01 AA 60 01 02"	= "時間簽名系統 380";
"06 09 2B 06 01 04 01 AA 60 01 03"	= "時間簽名系統 400";

/* MEDePass */

"06 09 2B 06 01 04 01 AD 0A 00 03"  = "次要實作";
"06 09 2B 06 01 04 01 AD 0A 00 04"  = "診斷識別碼";

/* Kerberos */

"06 05 2B 06 01 05 02"              = "Kerberos v5";
"06 06 2B 06 01 05 02 03"           = "Kerberos PKINIT";
"06 07 2B 06 01 05 02 03 01"        = "Kerberos 認證資料";
"06 07 2B 06 01 05 02 03 02"        = "Kerberos Diffie-Hellman 密鑰資料";
"06 07 2B 06 01 05 02 03 03"        = "Kerberos 回覆密鑰資料";
"06 07 2B 06 01 05 02 03 04"        = "Kerberos 用戶端認證";
"06 07 2B 06 01 05 02 03 05"        = "Kerberos 密鑰分配中心（KDC）";

/* IANA */

"06 06 2B 06 01 05 05 01"			= "簡單的公用密鑰機制（SPKM）";
"06 06 2B 06 01 05 05 02"			= "SPNEGO";

/* PKIX */

"06 06 2B 06 01 05 05 07"			= "公用密鑰基礎結構";

"06 07 2B 06 01 05 05 07 01"		= "PKIX 專用憑證延伸功能";
"06 08 2B 06 01 05 05 07 01 01"		= "憑證授權資訊存取";
"06 08 2B 06 01 05 05 07 01 02"		= "生理辨識資訊";
"06 08 2B 06 01 05 05 07 01 03"		= "合格憑證準則";
"06 08 2B 06 01 05 05 07 01 04"		= "屬性憑證審定識別";
"06 08 2B 06 01 05 05 07 01 05"		= "屬性憑證目標";
"06 08 2B 06 01 05 05 07 01 06"		= "屬性憑證授權控制";
"06 08 2B 06 01 05 05 07 01 07"		= "SBGP IP 位址區塊";
"06 08 2B 06 01 05 05 07 01 08"		= "SBGP 自主系統識別碼";
"06 08 2B 06 01 05 05 07 01 09"		= "SBGP 路由器識別碼";
"06 08 2B 06 01 05 05 07 01 0A"		= "屬性憑證代理伺服器";
"06 08 2B 06 01 05 05 07 01 0B"		= "主題資訊存取";
"06 08 2B 06 01 05 05 07 01 0C"		= "商標";

"06 07 2B 06 01 05 05 07 02"		= "規則辨識符號類型";
"06 08 2B 06 01 05 05 07 02 01"		= "憑證實作準則";
"06 08 2B 06 01 05 05 07 02 02"		= "使用者通知";
"06 08 2B 06 01 05 05 07 02 03"		= "文字通知";

"06 07 2B 06 01 05 05 07 03"		= "密鑰目的";
"06 08 2B 06 01 05 05 07 03 01"		= "伺服器認證";
"06 08 2B 06 01 05 05 07 03 02"		= "用戶端認證";
"06 08 2B 06 01 05 05 07 03 03"		= "代碼簽名";
"06 08 2B 06 01 05 05 07 03 04"		= "電子郵件保護";
"06 08 2B 06 01 05 05 07 03 05"		= "IPSEC 後端系統";
"06 08 2B 06 01 05 05 07 03 06"		= "IPSEC 通道";
"06 08 2B 06 01 05 05 07 03 07"		= "IPSEC 使用者";
"06 08 2B 06 01 05 05 07 03 08"		= "時間戳記";
"06 08 2B 06 01 05 05 07 03 09"		= "OCSP 簽名";
"06 08 2B 06 01 05 05 07 03 0A"		= "DVCS";
"06 08 2B 06 01 05 05 07 03 0B"		= "SBGP AA 伺服器認證";

"06 07 2B 06 01 05 05 07 04"		= "CMP 資訊類型";
"06 08 2B 06 01 05 05 07 04 01"		= "CA 通訊協定加密憑證";
"06 08 2B 06 01 05 05 07 04 02"		= "簽名密鑰配對類型";
"06 08 2B 06 01 05 05 07 04 03"		= "加密密鑰配對類型";
"06 08 2B 06 01 05 05 07 04 04"		= "偏好的對稱演算法";
"06 08 2B 06 01 05 05 07 04 05"		= "CA 密鑰更新簡介";
"06 08 2B 06 01 05 05 07 04 06"		= "現用 CRL";
"06 08 2B 06 01 05 05 07 04 07"		= "不支援的 OID";
"06 08 2B 06 01 05 05 07 04 08"		= "訂閱要求";
"06 08 2B 06 01 05 05 07 04 09"		= "訂閱回應";
"06 08 2B 06 01 05 05 07 04 0A"		= "密鑰配對參數要求";
"06 08 2B 06 01 05 05 07 04 0B"		= "密鑰配對參數回應";
/* %%% need to expand these labels, but can't find them documented anywhere online! */
"06 08 2B 06 01 05 05 07 04 0C"		= "revPassphrase";
"06 08 2B 06 01 05 05 07 04 0D"		= "implicitConfirm";
"06 08 2B 06 01 05 05 07 04 0E"		= "confirmWaitTime";
"06 08 2B 06 01 05 05 07 04 0F"		= "origPKIMessage";
"06 08 2B 06 01 05 05 07 04 10"		= "suppLangTags";

"06 07 2B 06 01 05 05 07 05"		= "CRMF 註冊";
"06 08 2B 06 01 05 05 07 05 01"		= "註冊控制選項";
"06 09 2B 06 01 05 05 07 05 01 01"	= "註冊代號";
"06 09 2B 06 01 05 05 07 05 01 02"	= "認證者";
"06 09 2B 06 01 05 05 07 05 01 03"	= "PKI 發佈簡介";
"06 09 2B 06 01 05 05 07 05 01 04"	= "PKI 封存選項";
"06 09 2B 06 01 05 05 07 05 01 05"	= "舊的憑證識別碼";
"06 09 2B 06 01 05 05 07 05 01 06"	= "通訊協定加密密鑰";
"06 09 2B 06 01 05 05 07 05 01 07"	= "交替憑證樣板";
"06 09 2B 06 01 05 05 07 05 01 08"	= "WAP WTLS 樣板";

"06 08 2B 06 01 05 05 07 05 02"		= "CRMF 註冊簡介";
"06 09 2B 06 01 05 05 07 05 02 01"	= "UTF-8 配對";
"06 09 2B 06 01 05 05 07 05 02 02"	= "憑證要求";

"06 07 2B 06 01 05 05 07 06"		= "演算法";
"06 08 2B 06 01 05 05 07 06 01"		= "DES-40";
"06 08 2B 06 01 05 05 07 06 02"		= "無簽名";
"06 08 2B 06 01 05 05 07 06 03"		= "dh-sig-hmac-sha1";
"06 08 2B 06 01 05 05 07 06 04"		= "dh-pop";

"06 07 2B 06 01 05 05 07 07"		= "CMC 控制項目";

"06 07 2B 06 01 05 05 07 08"		= "其他名稱";
"06 08 2B 06 01 05 05 07 08 01"		= "個人資料";
"06 08 2B 06 01 05 05 07 08 02"		= "使用者群組";

"06 07 2B 06 01 05 05 07 09"		= "個人資料";
"06 08 2B 06 01 05 05 07 09 01"		= "出生日期";
"06 08 2B 06 01 05 05 07 09 02"		= "出生地";
"06 08 2B 06 01 05 05 07 09 03"		= "筆名";
"06 08 2B 06 01 05 05 07 09 04"		= "性別";
"06 08 2B 06 01 05 05 07 09 05"		= "國籍";
"06 08 2B 06 01 05 05 07 09 06"		= "居住國";

"06 07 2B 06 01 05 05 07 0A"		= "屬性憑證";
"06 08 2B 06 01 05 05 07 0A 01"		= "認證資訊";
"06 08 2B 06 01 05 05 07 0A 02"		= "存取身分";
"06 08 2B 06 01 05 05 07 0A 03"		= "命令身分";
"06 08 2B 06 01 05 05 07 0A 04"		= "群組";
"06 08 2B 06 01 05 05 07 0A 05"		= "職位";
"06 08 2B 06 01 05 05 07 0A 06"		= "WLAN SSID";

/* OCSP */

"06 08 2B 06 01 05 05 07 30 01"		= "線上憑證的狀態通訊協定";
"06 09 2B 06 01 05 05 07 30 01 01"	= "OCSP 基本回應";
"06 09 2B 06 01 05 05 07 30 01 02"	= "OCSP 現時延伸功能";
"06 09 2B 06 01 05 05 07 30 01 03"	= "OCSP CRL 基準";
"06 09 2B 06 01 05 05 07 30 01 04"	= "OCSP 回應";
"06 09 2B 06 01 05 05 07 30 01 05"	= "OCSP 無撤銷核對";
"06 09 2B 06 01 05 05 07 30 01 06"	= "OCSP 封存中斷";
"06 09 2B 06 01 05 05 07 30 01 07"	= "OCSP 服務定位器";

"06 08 2B 06 01 05 05 07 30 02"		= "CA 簽發人";
"06 08 2B 06 01 05 05 07 30 03"		= "時間戳記";

/* ISAKMP */

"06 08 2B 06 01 05 05 08 01 01"		= "HMAC MD5";
"06 08 2B 06 01 05 05 08 01 02"		= "HMAC SHA-1";
"06 08 2B 06 01 05 05 08 01 03"		= "HMAC Tiger";
"06 08 2B 06 01 05 05 08 02 02"		= "IKE 中繼";

/* DEC (via ECMA) */

"06 07 2B 0C 02 87 73 07 01"		= "DEC 加密演算法";
"06 08 2B 0C 02 87 73 07 01 02"		= "DEC DEA";
"06 07 2B 0C 02 87 73 07 02"		= "DEC 雜湊演算法";
"06 07 2B 0C 02 87 73 07 02 01"		= "DEC MD2";
"06 07 2B 0C 02 87 73 07 02 02"		= "DEC MD4";
"06 07 2B 0C 02 87 73 07 03"		= "DEC 簽名演算法";
"06 07 2B 0C 02 87 73 07 03 01"		= "含 RSA 的 DEC MD2";
"06 07 2B 0C 02 87 73 07 03 02"		= "含 RSA 的 DEC MD4";
"06 07 2B 0C 02 87 73 07 03 03"		= "DEC DEA-MAC";

/* NIST Open Systems Environment (OSE) Implementor's Workshop (OIW) */

"06 05 2B 0E 02 1A 05"				= "SHA";
"06 06 2B 0E 03 02 01 01"			= "RSA";
"06 05 2B 0E 03 02 02"				= "含 RSA 的 MD4";
"06 05 2B 0E 03 02 03"				= "含 RSA 的 MD5";
"06 05 2B 0E 03 02 04"				= "含 RSA 加密的 MD4";
"06 06 2B 0E 03 02 02 01"			= "SqMod-N";
"06 06 2B 0E 03 02 03 01"			= "含 RSA 的 SqMod-N";
"06 05 2B 0E 03 02 06"				= "DES-ECB";
"06 05 2B 0E 03 02 07"				= "DES-CBC";
"06 05 2B 0E 03 02 08"				= "DES-OFB";
"06 05 2B 0E 03 02 09"				= "DES-CFB";
"06 05 2B 0E 03 02 0A"				= "DES-MAC";
"06 05 2B 0E 03 02 0B"				= "RSA 簽名";
"06 05 2B 0E 03 02 0C"				= "DSA";
"06 05 2B 0E 03 02 0D"				= "含 SHA 的 DSA";
"06 05 2B 0E 03 02 0E"				= "含 RSA 簽名的 MDC2";
"06 05 2B 0E 03 02 0F"				= "含 RSA 簽名的 SHA";
"06 05 2B 0E 03 02 10"				= "含 Common Modulus 的 Diffie-Hellman";
"06 05 2B 0E 03 02 11"				= "DES-EDE";
"06 05 2B 0E 03 02 12"				= "SHA";
"06 05 2B 0E 03 02 13"				= "MDC-2";
"06 05 2B 0E 03 02 14"				= "DSA Common";
"06 05 2B 0E 03 02 15"				= "含 SHA 的 DSA Common";
"06 05 2B 0E 03 02 16"				= "RSA 密鑰傳輸";
"06 05 2B 0E 03 02 17"				= "Keyed-hash-seal";
"06 05 2B 0E 03 02 18"				= "含 RSA 簽名的 MD2";
"06 05 2B 0E 03 02 19"				= "含 RSA 簽名的 MD5";
"06 05 2B 0E 03 02 1A"				= "SHA-1";
"06 05 2B 0E 03 02 1B"				= "含 SHA-1 的 DSA";
"06 05 2B 0E 03 02 1C"				= "含 Common SHA-1 的 DSA";
"06 05 2B 0E 03 02 1D"				= "含 RSA 加密的 SHA-1";
"06 05 2B 0E 03 03 01"				= "Simple-strong-auth-mechanism";
"06 06 2B 0E 07 02 01 01"			= "ElGamal";
"06 06 2B 0E 07 02 03 01"			= "含 RSA 的 MD2";
"06 06 2B 0E 07 02 03 02"			= "含 ElGamal 的 MD2";

/* Teletrust */

"06 03 2B 24 01"					= "文件";
"06 04 2B 24 01 01"					= "最終版本";
"06 04 2B 24 01 02"					= "草稿";
"06 03 2B 24 02"					= "SIO";
"06 04 2B 24 02 01"					= "SEDU";

"06 03 2B 24 03"					= "演算法";
"06 04 2B 24 03 01"					= "加密演算法";
"06 05 2B 24 03 01 01"				= "DES";
"06 06 2B 24 03 01 01 01"			= "DES-ECB Pad";
"06 07 2B 24 03 01 01 01 01"		= "DES-ECB ISO Pad";
"06 07 2B 24 03 01 01 02 01"		= "DES-CBC Pad";
"06 08 2B 24 03 01 01 02 01 01"		= "DES-CBC ISO Pad";
"06 05 2B 24 03 01 03"				= "DES3";
"06 07 2B 24 03 01 03 01 01"		= "DES3-ECB Pad";
"06 08 2B 24 03 01 03 01 01 01"		= "DES3-ECB ISO Pad";
"06 07 2B 24 03 01 03 02 01"		= "DES3-CBC Pad";
"06 08 2B 24 03 01 03 02 01 01"		= "DES3-CBC ISO Pad";
"06 05 2B 24 03 01 02"				= "IDEA";
"06 06 2B 24 03 01 02 01"			= "IDEA-ECB";
"06 07 2B 24 03 01 02 01 01"		= "IDEA-ECB Pad";
"06 08 2B 24 03 01 02 01 01 01"		= "IDEA-ECB ISO Pad";
"06 06 2B 24 03 01 02 02"			= "IDEA-CBC";
"06 07 2B 24 03 01 02 02 01"		= "IDEA-CBC Pad";
"06 08 2B 24 03 01 02 02 01 01"		= "IDEA-CBC ISO Pad";
"06 06 2B 24 03 01 02 03"			= "IDEA-OFB";
"06 06 2B 24 03 01 02 04"			= "IDEA-CFB";
"06 05 2B 24 03 01 04"				= "RSA 加密";
"06 05 2B 24 03 01 05"				= "BSI-1";
"06 06 2B 24 03 01 05 01"			= "BSI-1-ECB Pad";
"06 06 2B 24 03 01 05 02"			= "BSI-1-CBC Pad";
"06 07 2B 24 03 01 05 02 01"		= "BSI-1-CBC PEM Pad";

"06 04 2B 24 03 02"					= "雜湊演算法";
"06 05 2B 24 03 02 01"				= "RIPEMD-160";
"06 05 2B 24 03 02 02"				= "RIPEMD-128";
"06 05 2B 24 03 02 03"				= "RIPEMD-256";
"06 05 2B 24 03 02 04"				= "單一長度 MDC2";
"06 05 2B 24 03 02 05"				= "雙倍長度 MDC2";
"06 04 2B 24 03 03"					= "簽名演算法";
"06 05 2B 24 03 03 01"				= "RSA 簽名";

"06 06 2B 24 03 03 01 01"			= "含 SHA-1 的 RSA 簽名";
"06 09 2B 24 03 03 01 01 84 00 02"	= "含 SHA-1 512/L2 的 RSA 簽名";
"06 09 2B 24 03 03 01 01 85 00 02"	= "含 SHA-1 640/L2 的 RSA 簽名";
"06 09 2B 24 03 03 01 01 86 00 02"	= "含 SHA-1 768/L2 的 RSA 簽名";
"06 09 2B 24 03 03 01 01 87 00 02"	= "含 SHA-1 896/L2 的 RSA 簽名";
"06 09 2B 24 03 03 01 01 88 00 02"	= "含 SHA-1 1024/L2 的 RSA 簽名";
"06 09 2B 24 03 03 01 01 84 00 03"	= "含 SHA-1 512/L3 的 RSA 簽名";
"06 09 2B 24 03 03 01 01 85 00 03"	= "含 SHA-1 640/L3 的 RSA 簽名";
"06 09 2B 24 03 03 01 01 86 00 03"	= "含 SHA-1 768/L3 的 RSA 簽名";
"06 09 2B 24 03 03 01 01 87 00 03"	= "含 SHA-1 896/L3 的 RSA 簽名";
"06 09 2B 24 03 03 01 01 88 00 03"	= "含 SHA-1 1024/L3 的 RSA 簽名";
"06 09 2B 24 03 03 01 01 84 00 05"	= "含 SHA-1 512/L5 的 RSA 簽名";
"06 09 2B 24 03 03 01 01 85 00 05"	= "含 SHA-1 640/L5 的 RSA 簽名";
"06 09 2B 24 03 03 01 01 86 00 05"	= "含 SHA-1 768/L5 的 RSA 簽名";
"06 09 2B 24 03 03 01 01 87 00 05"	= "含 SHA-1 896/L5 的 RSA 簽名";
"06 09 2B 24 03 03 01 01 88 00 05"	= "含 SHA-1 1024/L5 的 RSA 簽名";
"06 09 2B 24 03 03 01 01 84 00 09"	= "含 SHA-1 512/L9 的 RSA 簽名";
"06 09 2B 24 03 03 01 01 85 00 09"	= "含 SHA-1 640/L9 的 RSA 簽名";
"06 09 2B 24 03 03 01 01 86 00 09"	= "含 SHA-1 768/L9 的 RSA 簽名";
"06 09 2B 24 03 03 01 01 87 00 09"	= "含 SHA-1 896/L9 的 RSA 簽名";
"06 09 2B 24 03 03 01 01 88 00 09"	= "含 SHA-1 1024/L9 的 RSA 簽名";
"06 09 2B 24 03 03 01 01 84 00 11"	= "含 SHA-1 512/L11 的 RSA 簽名";
"06 09 2B 24 03 03 01 01 85 00 11"	= "含 SHA-1 640/L11 的 RSA 簽名";
"06 09 2B 24 03 03 01 01 86 00 11"	= "含 SHA-1 768/L11 的 RSA 簽名";
"06 09 2B 24 03 03 01 01 87 00 11"	= "含 SHA-1 896/L11 的 RSA 簽名";
"06 09 2B 24 03 03 01 01 88 00 11"	= "含 SHA-1 1024/L11 的 RSA 簽名";

"06 06 2B 24 03 03 01 02"			= "含 RIPEMD-160 的 RSA 簽名";
"06 09 2B 24 03 03 01 02 84 00 02"	= "含 RIPEMD-160 512/L2 的 RSA 簽名";
"06 09 2B 24 03 03 01 02 85 00 02"	= "含 RIPEMD-160 640/L2 的 RSA 簽名";
"06 09 2B 24 03 03 01 02 86 00 02"	= "含 RIPEMD-160 768/L2 的 RSA 簽名";
"06 09 2B 24 03 03 01 02 87 00 02"	= "含 RIPEMD-160 896/L2 的 RSA 簽名";
"06 09 2B 24 03 03 01 02 88 00 02"	= "含 RIPEMD-160 1024/L2 的 RSA 簽名";
"06 09 2B 24 03 03 01 02 84 00 03"	= "含 RIPEMD-160 512/L3 的 RSA 簽名";
"06 09 2B 24 03 03 01 02 85 00 03"	= "含 RIPEMD-160 640/L3 的 RSA 簽名";
"06 09 2B 24 03 03 01 02 86 00 03"	= "含 RIPEMD-160 768/L3 的 RSA 簽名";
"06 09 2B 24 03 03 01 02 87 00 03"	= "含 RIPEMD-160 896/L3 的 RSA 簽名";
"06 09 2B 24 03 03 01 02 88 00 03"	= "含 RIPEMD-160 1024/L3 的 RSA 簽名";
"06 09 2B 24 03 03 01 02 84 00 05"	= "含 RIPEMD-160 512/L5 的 RSA 簽名";
"06 09 2B 24 03 03 01 02 85 00 05"	= "含 RIPEMD-160 640/L5 的 RSA 簽名";
"06 09 2B 24 03 03 01 02 86 00 05"	= "含 RIPEMD-160 768/L5 的 RSA 簽名";
"06 09 2B 24 03 03 01 02 87 00 05"	= "含 RIPEMD-160 896/L5 的 RSA 簽名";
"06 09 2B 24 03 03 01 02 88 00 05"	= "含 RIPEMD-160 1024/L5 的 RSA 簽名";
"06 09 2B 24 03 03 01 02 84 00 09"	= "含 RIPEMD-160 512/L9 的 RSA 簽名";
"06 09 2B 24 03 03 01 02 85 00 09"	= "含 RIPEMD-160 640/L9 的 RSA 簽名";
"06 09 2B 24 03 03 01 02 86 00 09"	= "含 RIPEMD-160 768/L9 的 RSA 簽名";
"06 09 2B 24 03 03 01 02 87 00 09"	= "含 RIPEMD-160 896/L9 的 RSA 簽名";
"06 09 2B 24 03 03 01 02 88 00 09"	= "含 RIPEMD-160 1024/L9 的 RSA 簽名";
"06 09 2B 24 03 03 01 02 84 00 11"	= "含 RIPEMD-160 512/L11 的 RSA 簽名";
"06 09 2B 24 03 03 01 02 85 00 11"	= "含 RIPEMD-160 640/L11 的 RSA 簽名";
"06 09 2B 24 03 03 01 02 86 00 11"	= "含 RIPEMD-160 768/L11 的 RSA 簽名";
"06 09 2B 24 03 03 01 02 87 00 11"	= "含 RIPEMD-160 896/L11 的 RSA 簽名";
"06 09 2B 24 03 03 01 02 88 00 11"	= "含 RIPEMD-160 1024/L11 的 RSA 簽名";

"06 06 2B 24 03 03 01 03"			= "含 RIPEMD-128 的 RSA 簽名";
"06 06 2B 24 03 03 01 04"			= "含 RIPEMD-256 的 RSA 簽名";

"06 05 2B 24 03 03 02"				= "ECSIE 簽名";
"06 06 2B 24 03 03 02 01"			= "含 SHA-1 的 ECSIE 簽名";
"06 06 2B 24 03 03 02 02"			= "含 RIPEMD-160 的 ECSIE 簽名";
"06 06 2B 24 03 03 02 03"			= "含 MD2 的 ECSIE 簽名";
"06 06 2B 24 03 03 02 04"			= "含 MD5 的 ECSIE 簽名";

"06 04 2B 24 03 04"					= "簽名架構";
"06 05 2B 24 03 04 01"				= "ISO9796-1";
"06 05 2B 24 03 04 02"				= "ISO9796-2";
"06 05 2B 24 03 04 02 01"			= "含 RED 的 ISO9796-2";
"06 06 2B 24 03 04 02 02"			= "含 RSA 的 ISO9796-2";
"06 06 2B 24 03 04 02 03"			= "含 RND 的 ISO9796-2";

"06 03 2B 24 04"					= "屬性";
"06 03 2B 24 05"					= "規則";
"06 03 2B 24 06"					= "API";
"06 04 2B 24 06 01"					= "特定製造商 API";
"06 05 2B 24 06 01 01"				= "UTIMACO-API";
"06 04 2B 24 06 02"					= "特定功能性 API";
"06 03 2B 24 07"					= "密鑰管理";
"06 04 2B 24 07 01"					= "密鑰協定";
"06 05 2B 24 07 01 01"				= "BSI PKE";
"06 04 2B 24 07 02"					= "密鑰傳送";
"06 05 2B 24 07 02 01"				= "含 RSA 加密的 ISO9796-2";

"06 05 2B 24 08 01 01"				= "Teletrust SigiSigConform 規則識別碼";
"06 05 2B 24 08 02 01"				= "目錄服務";

"06 05 2B 24 08 03 01"				= "憑證產生日期";
"06 05 2B 24 08 03 02"				= "代理";
"06 05 2B 24 08 03 03"				= "許可";
"06 05 2B 24 08 03 04"				= "金額限制";
"06 05 2B 24 08 03 05"				= "大多數的聲明";
"06 05 2B 24 08 03 06"				= "整合的電路卡序號";
"06 05 2B 24 08 03 07"				= "公用密鑰基準";
"06 05 2B 24 08 03 08"				= "限制";
"06 05 2B 24 08 03 09"				= "在允許的情況下檢索";
"06 05 2B 24 08 03 0A"				= "要求的憑證";
"06 05 2B 24 08 03 0B"				= "命名授權";
"06 05 2B 24 08 03 0C"				= "目錄中的憑證起始時間";
"06 05 2B 24 08 03 0D"				= "雜湊憑證";

"06 05 2B 24 08 04 01"				= "個人資料";
"06 05 2B 24 08 04 08"				= "限制";
"06 07 2B 24 08 05 01 01 01"		= "RSA 指定 SHA-1";
"06 07 2B 24 08 05 01 01 02"		= "RSA 指定 RIPEMD-160";
"06 07 2B 24 08 05 01 01 03"		= "含 SHA-1 的 RSA";
"06 07 2B 24 08 05 01 01 04"		= "含 RIPEMD-160 的 RSA";
"06 07 2B 24 08 05 01 02 01"		= "延伸的 DSA";
"06 07 2B 24 08 05 01 02 02"		= "含 RIPEMD-160 的 DSA";

"06 05 2B 24 08 06 01"				= "憑證";
"06 05 2B 24 08 06 02"				= "憑證基準";
"06 05 2B 24 08 06 03"				= "屬性憑證";
"06 05 2B 24 08 06 04"				= "屬性基準";
"06 05 2B 24 08 06 05"				= "檔案名稱";
"06 05 2B 24 08 06 06"				= "儲存時間";
"06 05 2B 24 08 06 07"				= "檔案大小";
"06 05 2B 24 08 06 08"				= "位置";
"06 05 2B 24 08 06 09"				= "簽名編號";
"06 05 2B 24 08 06 0A"				= "自動產生的";

"06 05 2B 24 08 07 01"				= "Teletrust 表示類型";
"06 06 2B 24 08 07 01 01"			= "Adobe Illustrator";
"06 06 2B 24 08 07 01 02"			= "AmiPro";
"06 06 2B 24 08 07 01 03"			= "AutoCAD";
"06 06 2B 24 08 07 01 04"			= "二進位";
"06 06 2B 24 08 07 01 05"			= "BMP";
"06 06 2B 24 08 07 01 06"			= "CGM";
"06 06 2B 24 08 07 01 07"			= "CorelCRT";
"06 06 2B 24 08 07 01 08"			= "CorelDRW";
"06 06 2B 24 08 07 01 09"			= "CorelEXC";
"06 06 2B 24 08 07 01 0A"			= "CorelPHT";
"06 06 2B 24 08 07 01 0B"			= "Draw";
"06 06 2B 24 08 07 01 0C"			= "DVI";
"06 06 2B 24 08 07 01 0D"			= "EPS";
"06 06 2B 24 08 07 01 0E"			= "Excel";
"06 06 2B 24 08 07 01 0F"			= "GEM";
"06 06 2B 24 08 07 01 10"			= "GIF";
"06 06 2B 24 08 07 01 11"			= "HPGL";
"06 06 2B 24 08 07 01 12"			= "JPEG";
"06 06 2B 24 08 07 01 13"			= "Kodak";
"06 06 2B 24 08 07 01 14"			= "LaTeX";
"06 06 2B 24 08 07 01 15"			= "Lotus";
"06 06 2B 24 08 07 01 16"			= "LotusPIC";
"06 06 2B 24 08 07 01 17"			= "MacPICT";
"06 06 2B 24 08 07 01 18"			= "MacWord";
"06 06 2B 24 08 07 01 19"			= "MSWfD";
"06 06 2B 24 08 07 01 1A"			= "MSWord";
"06 06 2B 24 08 07 01 1B"			= "MSWord2";
"06 06 2B 24 08 07 01 1C"			= "MSWord6";
"06 06 2B 24 08 07 01 1D"			= "MSWord8";
"06 06 2B 24 08 07 01 1E"			= "PDF";
"06 06 2B 24 08 07 01 1F"			= "PIF";
"06 06 2B 24 08 07 01 20"			= "PostScript";
"06 06 2B 24 08 07 01 21"			= "RTF";
"06 06 2B 24 08 07 01 22"			= "SCITEX";
"06 06 2B 24 08 07 01 23"			= "TAR";
"06 06 2B 24 08 07 01 24"			= "Targa";
"06 06 2B 24 08 07 01 25"			= "TeX";
"06 06 2B 24 08 07 01 26"			= "文字";
"06 06 2B 24 08 07 01 27"			= "TIFF";
"06 06 2B 24 08 07 01 28"			= "TIFF-FC";
"06 06 2B 24 08 07 01 29"			= "UID";
"06 06 2B 24 08 07 01 2A"			= "UUEncode";
"06 06 2B 24 08 07 01 2B"			= "WMF";
"06 06 2B 24 08 07 01 2C"			= "WordPerfect";
"06 06 2B 24 08 07 01 2D"			= "WPGrph";

/* Thawte */

"06 04 2B 65 01 04"					= "Thawte 憑證延伸功能";
"06 05 2B 65 01 04 01"				= "強力外部網路";

/* X.520 */

"06 02 55 04"		= "X.520 屬性類別";
"06 03 55 04 00"	= "物件類別";
"06 03 55 04 01"	= "替用的輸入名稱";
"06 03 55 04 02"	= "知識資訊";
"06 03 55 04 03"	= "一般名稱";
"06 03 55 04 04"	= "姓氏";
"06 03 55 04 05"	= "序號";
"06 03 55 04 06"	= "國名";
"06 03 55 04 07"	= "所在地名";
"06 04 55 04 07 01"	= "集合的所在地名";
"06 03 55 04 08"	= "州或省名";
"06 04 55 04 08 01"	= "集合的州或省名";
"06 03 55 04 09"	= "街道地址";
"06 04 55 04 09 01"	= "集合的街道地址";
"06 03 55 04 0A"	= "組織名稱";
"06 04 55 04 0A 01"	= "集合的組織名稱";
"06 03 55 04 0B"	= "組織單位名稱";
"06 04 55 04 0B 01"	= "集合的組織單位名稱";
"06 03 55 04 0C"	= "標題";
"06 03 55 04 0D"	= "描述";
"06 03 55 04 0E"	= "搜尋導引";
"06 03 55 04 0F"	= "商業類別";
"06 03 55 04 10"	= "郵寄地址";
"06 04 55 04 10 01"	= "集合的郵件地址";
"06 03 55 04 11"	= "郵遞區號";
"06 04 55 04 11 01"	= "集合的郵遞區號";
"06 03 55 04 12"	= "郵政信箱";
"06 04 55 04 12 01"	= "集合的郵政信箱";
"06 03 55 04 13"	= "實際寄送的公司名稱";
"06 04 55 04 13 01"	= "集合的實際寄送的公司名稱";
"06 03 55 04 14"	= "電話號碼";
"06 04 55 04 14 01"	= "集合的電話號碼";
"06 03 55 04 15"	= "電傳號碼";
"06 04 55 04 15 01"	= "集合的電傳號碼";
"06 03 55 04 16"	= "電傳圖文終端識別碼";
"06 04 55 04 16 01"	= "集合的電傳圖文終端識別碼";
"06 03 55 04 17"	= "傳真電話號碼";
"06 04 55 04 17 01"	= "集合的傳真電話號碼";
"06 03 55 04 18"	= "X.121 位址";
"06 03 55 04 19"	= "國際 ISDN 號碼";
"06 04 55 04 19 01"	= "集合的國際 ISDN 號碼";
"06 03 55 04 1A"	= "已註冊的地址";
"06 03 55 04 1B"	= "目標識別碼";
"06 03 55 04 1C"	= "偏好的寄送方式";
"06 03 55 04 1D"	= "現住地址";
"06 03 55 04 1E"	= "支援的應用程式上下文";
"06 03 55 04 1F"	= "成員";
"06 03 55 04 20"	= "持有人";
"06 03 55 04 21"	= "職位擔任者";
"06 03 55 04 22"	= "也請見";
"06 03 55 04 23"	= "使用者密碼";
"06 03 55 04 24"	= "使用者憑證";
"06 03 55 04 25"	= "CA 憑證";
"06 03 55 04 26"	= "授權撤銷列表";
"06 03 55 04 27"	= "憑證撤銷列表";
"06 03 55 04 28"	= "交叉憑證配對";
"06 03 55 04 29"	= "名稱";
"06 03 55 04 2A"	= "名字";
"06 03 55 04 2B"	= "起始字母";
"06 03 55 04 2C"	= "世代辨識符號";
"06 03 55 04 2D"	= "唯一識別碼";
"06 03 55 04 2E"	= "DN 辨識符號";
"06 03 55 04 2F"	= "增強的搜尋導引";
"06 03 55 04 30"	= "通訊協定資訊";
"06 03 55 04 31"	= "識別的名稱";
"06 03 55 04 32"	= "獨有的成員";
"06 03 55 04 33"	= "住宅識別碼";
"06 03 55 04 34"	= "支援的演算法";
"06 03 55 04 35"	= "Delta 撤銷列表";
"06 03 55 04 36"	= "清除";
"06 03 55 04 3A"	= "交叉憑證配對";

/* X.500 object classes */

"06 02 55 06"		= "X.520 物件類別";
"06 03 55 06 00"	= "頂端";
"06 03 55 06 01"	= "替身";
"06 03 55 06 02"	= "國家";
"06 03 55 06 03"	= "所在地";
"06 03 55 06 04"	= "組織";
"06 03 55 06 05"	= "組織單位";
"06 03 55 06 06"	= "個人";
"06 03 55 06 07"	= "組織個人";
"06 03 55 06 08"	= "組織職位";
"06 03 55 06 09"	= "名稱群組";
"06 03 55 06 0A"	= "居住地的個人";
"06 03 55 06 0B"	= "應用程式程序";
"06 03 55 06 0C"	= "應用程式實體";
"06 03 55 06 0D"	= "DSA";
"06 03 55 06 0E"	= "裝置";
"06 03 55 06 0F"	= "強力認證使用者";
"06 03 55 06 10"	= "憑證授權";
"06 03 55 06 11"	= "獨有名稱的群組";
"06 03 55 06 15"	= "PKI 使用者";
"06 03 55 06 16"	= "PKI CA";

/* X.500 algorithms */

"06 02 55 08"		= "X.500 演算法";
"06 03 55 08 01"	= "X.500 加密演算法";
"06 04 55 08 01 01"	= "RSA";

/* X.509 */

"06 02 55 1D"		= "X.509 憑證延伸功能";
"06 03 55 1D 01"	= "授權密鑰識別碼（舊）";
"06 03 55 1D 02"	= "主要密鑰屬性（舊）";
"06 03 55 1D 03"	= "憑證規則（舊）";
"06 03 55 1D 04"	= "密鑰使用限制（舊）";
"06 03 55 1D 05"	= "規則對應（舊）";
"06 03 55 1D 06"	= "子目錄樹限制";
"06 03 55 1D 07"	= "主題替用名稱（舊）";
"06 03 55 1D 08"	= "簽發人替用名稱（舊）";
"06 03 55 1D 09"	= "主題目錄屬性";
"06 03 55 1D 0A"	= "基本限制（舊 2.5.29.10）";
"06 03 55 1D 0B"	= "名稱限制（舊）";
"06 03 55 1D 0C"	= "規則限制（舊）";
"06 03 55 1D 0D"	= "基本限制（舊 2.5.29.13）";
"06 03 55 1D 0E"	= "主題密鑰識別碼";
"06 03 55 1D 0F"	= "密鑰用途";
"06 03 55 1D 10"	= "專用密鑰使用期間";
"06 03 55 1D 11"	= "主題替用名稱";
"06 03 55 1D 12"	= "簽發人替用名稱";
"06 03 55 1D 13"	= "基本限制";
"06 03 55 1D 14"	= "憑證撤銷列表數目";
"06 03 55 1D 15"	= "CRL 原因代碼";
"06 03 55 1D 16"	= "到期日（舊）";
"06 03 55 1D 17"	= "保持指令碼";
"06 03 55 1D 18"	= "無效日期";
"06 03 55 1D 19"	= "CRL 分配點（舊）";
"06 03 55 1D 1A"	= "發行分配點（舊）";
"06 03 55 1D 1B"	= "增量 CRL 指示器";
"06 03 55 1D 1C"	= "發行分配點";
"06 03 55 1D 1D"	= "憑證簽發人";
"06 03 55 1D 1E"	= "名稱限制";
"06 03 55 1D 1F"	= "CRL 分配點";
"06 03 55 1D 20"	= "憑證規則";
"06 04 55 1D 20 00"	= "任何規則識別碼";
"06 03 55 1D 21"	= "規則對應";
"06 03 55 1D 22"	= "規則限制";
"06 03 55 1D 23"	= "授權密鑰識別碼";
"06 03 55 1D 24"	= "規則限制";
"06 03 55 1D 25"	= "延伸的密鑰用途";
"06 04 55 1D 25 00"	= "任何延伸密鑰用途";

/* DMS - SDN.700 INFOSEC algorithms */

"06 09 60 86 48 01 65 02 01 01 01"	= "SDNS 簽名演算法";
"06 09 60 86 48 01 65 02 01 01 02"	= "Fortezza 簽名演算法";
"06 09 60 86 48 01 65 02 01 01 03"	= "SDNS 機密演算法";
"06 09 60 86 48 01 65 02 01 01 04"	= "Fortezza 機密演算法";
"06 09 60 86 48 01 65 02 01 01 05"	= "SDNS 完整演算法";
"06 09 60 86 48 01 65 02 01 01 06"	= "Fortezza 完整演算法";
"06 09 60 86 48 01 65 02 01 01 07"	= "SDNS 代號保護演算法";
"06 09 60 86 48 01 65 02 01 01 08"	= "Fortezza 代號保護演算法";
"06 09 60 86 48 01 65 02 01 01 09"	= "SDNS 密鑰管理演算法";
"06 09 60 86 48 01 65 02 01 01 0A"	= "Fortezza 密鑰管理演算法";
"06 09 60 86 48 01 65 02 01 01 0B"	= "SDNS 密鑰管理和簽名演算法";
"06 09 60 86 48 01 65 02 01 01 0C"	= "Fortezza 密鑰管理和簽名演算法";
"06 09 60 86 48 01 65 02 01 01 0D"	= "Suite A 簽名演算法";
"06 09 60 86 48 01 65 02 01 01 0E"	= "Suite A 機密演算法";
"06 09 60 86 48 01 65 02 01 01 0F"	= "Suite A 完整演算法";
"06 09 60 86 48 01 65 02 01 01 10"	= "Suite A 代號保護演算法";
"06 09 60 86 48 01 65 02 01 01 11"	= "Suite A 密鑰管理演算法";
"06 09 60 86 48 01 65 02 01 01 12"	= "Suite A 密鑰管理和簽名演算法";
"06 09 60 86 48 01 65 02 01 01 13"	= "Fortezza 更新後的簽名演算法";
"06 09 60 86 48 01 65 02 01 01 14"	= "Fortezza 密鑰管理和更新後的簽名演算法";
"06 09 60 86 48 01 65 02 01 01 15"	= "Fortezza 更新後的完整演算法";
"06 09 60 86 48 01 65 02 01 01 16"	= "密鑰交換演算法";
"06 09 60 86 48 01 65 02 01 01 17"	= "Fortezza Wrap80 演算法";
"06 09 60 86 48 01 65 02 01 01 18"	= "密鑰加密演算法（KEA）";

"06 09 60 86 48 01 65 02 01 02 01"	= "RFC 822 訊息格式";
"06 09 60 86 48 01 65 02 01 02 02"	= "沒有內容";
"06 09 60 86 48 01 65 02 01 02 03"	= "CSP 內容類型";
"06 09 60 86 48 01 65 02 01 02 2A"	= "MSP Rev 3 內容類型";
"06 09 60 86 48 01 65 02 01 02 30"	= "MSP 內容類型";
"06 09 60 86 48 01 65 02 01 02 31"	= "MSP Rekey 代理通訊協定";
"06 09 60 86 48 01 65 02 01 02 32"	= "MSP MMP";
"06 09 60 86 48 01 65 02 01 02 42"	= "MSP Rev 3.1 內容類型";
"06 09 60 86 48 01 65 02 01 02 48"	= "轉發的 MSP 訊息正文部分";
"06 09 60 86 48 01 65 02 01 02 49"	= "MSP 轉發的訊息參數";
"06 09 60 86 48 01 65 02 01 02 50"	= "轉發的 CSP 訊息正文部分";
"06 09 60 86 48 01 65 02 01 02 51"	= "CSP 轉發的訊息參數";
"06 09 60 86 48 01 65 02 01 02 52"	= "MSP MMP2";

/* SDN.700 INFOSEC policy */

"06 09 60 86 48 01 65 02 01 03 01"		= "SDNS 安全性規則";
"06 09 60 86 48 01 65 02 01 03 02"		= "SDNS PRBAC";
"06 09 60 86 48 01 65 02 01 03 03"		= "Mosaic PRBAC";

"06 09 60 86 48 01 65 02 01 03 0A"		= "安全性規則";
"06 0A 60 86 48 01 65 02 01 03 0A 00"	= "NASP";
"06 0A 60 86 48 01 65 02 01 03 0A 01"	= "ELCO";
"06 0A 60 86 48 01 65 02 01 03 0A 02"	= "TK";
"06 0A 60 86 48 01 65 02 01 03 0A 03"	= "DSAP";
"06 0A 60 86 48 01 65 02 01 03 0A 04"	= "SSSS";
"06 0A 60 86 48 01 65 02 01 03 0A 05"	= "DNASP";
"06 0A 60 86 48 01 65 02 01 03 0A 06"	= "BYEMAN";
"06 0A 60 86 48 01 65 02 01 03 0A 07"	= "REL-US";
"06 0A 60 86 48 01 65 02 01 03 0A 08"	= "REL-AUS";
"06 0A 60 86 48 01 65 02 01 03 0A 09"	= "REL-CAN";
"06 0A 60 86 48 01 65 02 01 03 0A 0A"	= "REL-UK";
"06 0A 60 86 48 01 65 02 01 03 0A 0B"	= "REL-NZ";
"06 0A 60 86 48 01 65 02 01 03 0A 0C"	= "一般";

"06 09 60 86 48 01 65 02 01 03 0B"			= "genser";
"06 0A 60 86 48 01 65 02 01 03 0B 00"		= "genserNations";
"06 0A 60 86 48 01 65 02 01 03 0B 01"		= "genserComsec";
"06 0A 60 86 48 01 65 02 01 03 0B 02"		= "genserAcquisition";
"06 0A 60 86 48 01 65 02 01 03 0B 03"		= "genserSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0B 03 00"	= "genserTagSetName";

"06 09 60 86 48 01 65 02 01 03 0C"			= "預設安全性規則";
"06 09 60 86 48 01 65 02 01 03 0D"			= "capcoMarkings";
"06 0A 60 86 48 01 65 02 01 03 0D 00"		= "capcoSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0D 00 01"	= "capcoTagSetName1";
"06 0B 60 86 48 01 65 02 01 03 0D 00 02"	= "capcoTagSetName2";
"06 0B 60 86 48 01 65 02 01 03 0D 00 03"	= "capcoTagSetName3";
"06 0B 60 86 48 01 65 02 01 03 0D 00 04"	= "capcoTagSetName4";

"06 09 60 86 48 01 65 02 01 05 01"	= "SDNS 密鑰管理憑證";
"06 09 60 86 48 01 65 02 01 05 02"	= "SDNS 使用者簽名憑證";
"06 09 60 86 48 01 65 02 01 05 03"	= "SDNS 密鑰管理和簽名憑證";
"06 09 60 86 48 01 65 02 01 05 04"	= "Fortezza 密鑰管理憑證";
"06 09 60 86 48 01 65 02 01 05 05"	= "Fortezza 密鑰管理和簽名憑證";
"06 09 60 86 48 01 65 02 01 05 06"	= "Fortezza 使用者簽名憑證";
"06 09 60 86 48 01 65 02 01 05 07"	= "Fortezza CA 簽名憑證";
"06 09 60 86 48 01 65 02 01 05 08"	= "SDNS CA 簽名憑證";
"06 09 60 86 48 01 65 02 01 05 0A"	= "輔助向量";
"06 09 60 86 48 01 65 02 01 05 0B"	= "接受規則";
"06 09 60 86 48 01 65 02 01 05 0C"	= "成員關係";
"06 09 60 86 48 01 65 02 01 05 0D"	= "管理者";
"06 09 60 86 48 01 65 02 01 05 0E"	= "alid";
"06 09 60 86 48 01 65 02 01 05 14"	= "janUKMs";
"06 09 60 86 48 01 65 02 01 05 15"	= "febUKMs";
"06 09 60 86 48 01 65 02 01 05 16"	= "marUKMs";
"06 09 60 86 48 01 65 02 01 05 17"	= "aprUKMs";
"06 09 60 86 48 01 65 02 01 05 18"	= "mayUKMs";
"06 09 60 86 48 01 65 02 01 05 19"	= "junUKMs";
"06 09 60 86 48 01 65 02 01 05 1A"	= "julUKMs";
"06 09 60 86 48 01 65 02 01 05 1B"	= "augUKMs";
"06 09 60 86 48 01 65 02 01 05 1C"	= "sepUKMs";
"06 09 60 86 48 01 65 02 01 05 1D"	= "octUKMs";
"06 09 60 86 48 01 65 02 01 05 1E"	= "novUKMs";
"06 09 60 86 48 01 65 02 01 05 1F"	= "decUKMs";

"06 09 60 86 48 01 65 02 01 05 28"	= "元 SDNS CKL";
"06 09 60 86 48 01 65 02 01 05 29"	= "SDNS CKL";
"06 09 60 86 48 01 65 02 01 05 2A"	= "元 SDNS 簽名 CKL";
"06 09 60 86 48 01 65 02 01 05 2B"	= "SDNS 簽名 CKL";
"06 09 60 86 48 01 65 02 01 05 2C"	= "SDNS 憑證撤銷列表";
"06 09 60 86 48 01 65 02 01 05 2D"	= "Fortezza 憑證撤銷列表";
"06 09 60 86 48 01 65 02 01 05 2E"	= "Fortezza CKL";
"06 09 60 86 48 01 65 02 01 05 2F"	= "免除的位址處理器";
"06 09 60 86 48 01 65 02 01 05 30"	= "Guard";
"06 09 60 86 48 01 65 02 01 05 31"	= "演算法支援";
"06 09 60 86 48 01 65 02 01 05 32"	= "Suite A 密鑰管理憑證";
"06 09 60 86 48 01 65 02 01 05 33"	= "Suite A 密鑰管理和簽名憑證";
"06 09 60 86 48 01 65 02 01 05 34"	= "Suite A 使用者簽名憑證";
"06 09 60 86 48 01 65 02 01 05 35"	= "PRBAC 簡介";
"06 09 60 86 48 01 65 02 01 05 36"	= "PRBAC CA 限制";
"06 09 60 86 48 01 65 02 01 05 37"	= "簽名或密鑰管理權限";
"06 09 60 86 48 01 65 02 01 05 38"	= "一般權限";
"06 09 60 86 48 01 65 02 01 05 39"	= "標注的屬性";
"06 09 60 86 48 01 65 02 01 05 3A"	= "規則資訊檔案";
"06 09 60 86 48 01 65 02 01 05 3B"	= "Sec 規則資訊檔案";
"06 09 60 86 48 01 65 02 01 05 3C"	= "CA 清除限制";

"06 09 60 86 48 01 65 02 01 07 01"		= "CSP 延伸功能";
"06 0A 60 86 48 01 65 02 01 07 01 00"	= "cspCsExtn";
"06 09 60 86 48 01 65 02 01 08 01"		= "ISSI 安全性類別";
"06 09 60 86 48 01 65 02 01 08 02"		= "標準安全性標籤權限";

"06 09 60 86 48 01 65 02 01 0A 01"			= "簽名權限";
"06 09 60 86 48 01 65 02 01 0A 02"			= "密鑰管理權限";
"06 09 60 86 48 01 65 02 01 0A 03"			= "命名標籤的設定權限";
"06 09 60 86 48 01 65 02 01 0B 01"			= "UK 示範";
"06 09 60 86 48 01 65 02 01 0B 02"			= "美國國防部類別 2";
"06 09 60 86 48 01 65 02 01 0B 03"			= "美式中型控製器";
"06 09 60 86 48 01 65 02 01 0B 04"			= "美國國防部類別 4";
"06 09 60 86 48 01 65 02 01 0B 05"			= "美國國防部類別 3";
"06 09 60 86 48 01 65 02 01 0B 06"			= "美國國防部類別 5";
"06 09 60 86 48 01 65 02 01 0B 09"			= "美國國防部 PKI 類別 3";

"06 09 60 86 48 01 65 02 01 0C 00"			= "測試安全性規則";
"06 0A 60 86 48 01 65 02 01 0C 00 01"		= "TSP1";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00"	= "TSP1 SecurityCategories";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 00"	= "TSP1 標籤組 0";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 01"	= "TSP1 標籤組 1";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 02"	= "TSP1 標籤組 2";
"06 0A 60 86 48 01 65 02 01 0C 00 02"		= "TSP2";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00"	= "TSP2 安全性類別";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 00"	= "TSP2 標籤組 0";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 01"	= "TSP2 標籤組 1";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 02"	= "TSP2 標籤組 2";

"06 0A 60 86 48 01 65 02 01 0C 00 03"		= "Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00"	= "Kafka 安全性類別";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 01"	= "Kafka 標籤組名稱 1";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 02"	= "Kafka 標籤組名稱 2";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 03"	= "Kafka 標籤組名稱 3";

"06 0A 60 86 48 01 65 02 01 0C 01 01"		= "TCP1";
"06 09 60 86 48 01 65 02 01 0C 02"			= "測試 CRL 輸入";

/* CSOR GAK-FIPS */

"06 07 60 86 48 01 65 03 01"			= "標籤";
"06 07 60 86 48 01 65 03 02"			= "PKI";
"06 08 60 86 48 01 65 03 02 01"			= "GAK 規則識別碼";
"06 0A 60 86 48 01 65 03 02 01 03 01"	= "FBCA 基本級規則識別碼";
"06 0A 60 86 48 01 65 03 02 01 03 02"	= "FBCA 初級規則識別碼";
"06 0A 60 86 48 01 65 03 02 01 03 03"	= "FBCA 中級規則識別碼";
"06 0A 60 86 48 01 65 03 02 01 03 04"	= "FBCA 高級規則識別碼";
"06 08 60 86 48 01 65 03 02 02"			= "GAK";
"06 09 60 86 48 01 65 03 02 02 01"		= "KRA 密鑰";
"06 08 60 86 48 01 65 03 02 03"			= "延伸功能";
"06 09 60 86 48 01 65 03 02 03 01"		= "密鑰恢復技術";
"06 09 60 86 48 01 65 03 02 03 02"		= "可以密鑰恢復";
"06 09 60 86 48 01 65 03 02 03 03"		= "密鑰恢復";
"06 08 60 86 48 01 65 03 02 04"			= "密鑰恢復架構";
"06 08 60 86 48 01 65 03 02 05"			= "CSOR GAK 延伸功能";
"06 07 60 86 48 01 65 03 03"			= "ARPA";

/* CSOR (NIST) Algorithms */

"06 07 60 86 48 01 65 03 04"			= "NIST 演算法";
"06 08 60 86 48 01 65 03 04 01"			= "AES";
"06 09 60 86 48 01 65 03 04 01 01"		= "AES 128-ECB";
"06 09 60 86 48 01 65 03 04 01 02"		= "AES 128-CBC";
"06 09 60 86 48 01 65 03 04 01 03"		= "AES 128-OFB";
"06 09 60 86 48 01 65 03 04 01 04"		= "AES 128-CFB";
"06 09 60 86 48 01 65 03 04 01 15"		= "AES 192-ECB";
"06 09 60 86 48 01 65 03 04 01 16"		= "AES 192-CBC";
"06 09 60 86 48 01 65 03 04 01 17"		= "AES 192-OFB";
"06 09 60 86 48 01 65 03 04 01 18"		= "AES 192-CFB";
"06 09 60 86 48 01 65 03 04 01 29"		= "AES 256-ECB";
"06 09 60 86 48 01 65 03 04 01 2A"		= "AES 256-CBC";
"06 09 60 86 48 01 65 03 04 01 2B"		= "AES 256-OFB";
"06 09 60 86 48 01 65 03 04 01 2C"		= "AES 256-CFB";

/* NIST secure hash algorithms */

"06 08 60 86 48 01 65 03 04 02"         = "SHA";
"06 09 60 86 48 01 65 03 04 02 01"      = "SHA-256";
"06 09 60 86 48 01 65 03 04 02 02"      = "SHA-384";
"06 09 60 86 48 01 65 03 04 02 03"      = "SHA-512";
"06 09 60 86 48 01 65 03 04 02 04"      = "SHA-224";

/* Novell */

"06 0A 60 86 48 01 86 F8 37 01 02 08"		= "Novell 演算法";
"06 0B 60 86 48 01 86 F8 37 01 02 08 16"	= "DES-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 17"	= "DES-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 18"	= "DES-EDE2-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 19"	= "DES-EDE2-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1A"	= "DES-EDE3-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1B"	= "DES-EDE3-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1C"	= "RC5-CBC Pad";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1D"	= "含 RSA 加密 BSAFE1 的 MD2";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1E"	= "含 RSA 加密 BSAFE1 的 MD5";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1F"	= "含 RSA 加密 BSAFE1 的 SHA-1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 20"	= "LM 摘要";
"06 0B 60 86 48 01 86 F8 37 01 02 08 28"	= "MD2";
"06 0B 60 86 48 01 86 F8 37 01 02 08 32"	= "MD5";
"06 0B 60 86 48 01 86 F8 37 01 02 08 33"	= "含 SHA1-RSA 的 IKE HMAC";
"06 0B 60 86 48 01 86 F8 37 01 02 08 34"	= "含 MD5-RSA 的 IKE HMAC";
"06 0B 60 86 48 01 86 F8 37 01 02 08 45"	= "RC2-CBC Pad";
"06 0B 60 86 48 01 86 F8 37 01 02 08 52"	= "SHA-1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5C"	= "RC2-CBC BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5F"	= "MD4";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 02"	= "MD4 封包";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 03"	= "RSA 加密 BSAFE1";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 04"	= "NW 密碼";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 05"	= "Novell Obfuscate-1";

"06 09 60 86 48 01 86 F8 37 01 09"			= "PKI";
"06 0A 60 86 48 01 86 F8 37 01 09 04"		= "PKI 屬性類型";
"06 0B 60 86 48 01 86 F8 37 01 09 04 01"	= "安全性屬性";
"06 0B 60 86 48 01 86 F8 37 01 09 04 02"	= "信賴限制";

/* Netscape */

"06 07 60 86 48 01 86 F8 42"		= "Netscape 目標識別碼";
"06 08 60 86 48 01 86 F8 42 01"		= "Netscape 憑證延伸功能";
"06 09 60 86 48 01 86 F8 42 01 01"	= "Netscape 憑證類型";
"06 09 60 86 48 01 86 F8 42 01 02"	= "Netscape 基本 URL";
"06 09 60 86 48 01 86 F8 42 01 03"	= "Netscape 撤銷 URL";
"06 09 60 86 48 01 86 F8 42 01 04"	= "Netscape CA 撤銷 URL";
"06 09 60 86 48 01 86 F8 42 01 05"	= "Netscape CRL 下載 URL";
"06 09 60 86 48 01 86 F8 42 01 06"	= "Netscape CA 憑證下載 URL";
"06 09 60 86 48 01 86 F8 42 01 07"	= "Netscape 憑證更新 URL";
"06 09 60 86 48 01 86 F8 42 01 08"	= "Netscape CA 規則 URL";
"06 09 60 86 48 01 86 F8 42 01 09"	= "Netscape 憑證首頁 URL";
"06 09 60 86 48 01 86 F8 42 01 0A"	= "Netscape 憑證的實體標誌";
"06 09 60 86 48 01 86 F8 42 01 0B"	= "Netscape 憑證的使用者圖片";
"06 09 60 86 48 01 86 F8 42 01 0C"	= "Netscape SSL 伺服器名稱";
"06 09 60 86 48 01 86 F8 42 01 0D"	= "Netscape 憑證說明";

"06 08 60 86 48 01 86 F8 42 02"		= "Netscape 資料類型";
"06 09 60 86 48 01 86 F8 42 02 01"	= "image/GIF";
"06 09 60 86 48 01 86 F8 42 02 02"	= "image/JPEG";
"06 09 60 86 48 01 86 F8 42 02 03"	= "URL";
"06 09 60 86 48 01 86 F8 42 02 04"	= "text/HTML";

"06 09 60 86 48 01 86 F8 42 02 05"	= "Netscape 憑證順序";
"06 09 60 86 48 01 86 F8 42 02 06"	= "Netscape 憑證 URL";

"06 08 60 86 48 01 86 F8 42 03"			= "Netscape 目錄目標識別碼";
"06 09 60 86 48 01 86 F8 42 03 01"		= "LDAP 定義";
"06 0A 60 86 48 01 86 F8 42 03 01 01"	= "車牌";
"06 0A 60 86 48 01 86 F8 42 03 01 02"	= "部門編號";
"06 0A 60 86 48 01 86 F8 42 03 01 03"	= "雇員編號";
"06 0A 60 86 48 01 86 F8 42 03 01 04"	= "雇員類型";
"06 0A 60 86 48 01 86 F8 42 03 02 02"	= "Intranet 的組織個人";

"06 09 60 86 48 01 86 F8 42 04 01"		= "伺服器通道加密";

/* Verisign */

/* Country, zip, date of birth (age), and gender of cert owner (CZAG) in obfuscated form */
"06 0A 60 86 48 01 86 F8 45 01 06 03"	= "Verisign CZAG";

/* Text string used in certs issued to Netscape InBox customers */
"06 0A 60 86 48 01 86 F8 45 01 06 06"	= "Verisign 收件匣";

"06 0A 60 86 48 01 86 F8 45 01 06 0B"	= "未知的 Verisign VPN 延伸功能";
"06 0A 60 86 48 01 86 F8 45 01 06 0D"	= "未知的 Verisign VPN 延伸功能";

"06 0B 60 86 48 01 86 F8 45 01 07 01 01"	= "Verisign 規則識別碼";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 01"	= "Verisign CPS v1 通知";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 02"	= "Verisign CPS v1 NSI";

"06 0A 60 86 48 01 86 F8 45 01 08 01"		= "Verisign SGC CA";

/* SET */

"06 03 67 2A 00"	= "內容類型";
"06 04 67 2A 00 00"	= "PAN 資料";
"06 04 67 2A 00 01"	= "PAN 代號";
"06 04 67 2A 00 02"	= "僅 PAN";

"06 03 67 2A 01"	= "訊息延伸功能";
"06 03 67 2A 02"	= "欄位";
"06 04 67 2A 02 00"	= "全名";
"06 04 67 2A 02 01"	= "名字";
"06 04 67 2A 02 02"	= "姓氏";
"06 04 67 2A 02 03"	= "出生姓氏";
"06 04 67 2A 02 04"	= "地名";
"06 04 67 2A 02 05"	= "識別號碼";
"06 04 67 2A 02 06"	= "月";
"06 04 67 2A 02 07"	= "日期";
"06 04 67 2A 02 08"	= "地址";
"06 04 67 2A 02 09"	= "電話";
"06 04 67 2A 02 0A"	= "合計";
"06 04 67 2A 02 0B"	= "帳號號碼";
"06 04 67 2A 02 0C"	= "密語";

"06 03 67 2A 03"		= "屬性";
"06 04 67 2A 03 00"		= "憑證";
"06 05 67 2A 03 00 00"	= "根密鑰指紋";
"06 05 67 2A 03 00 01"	= "附加的規則";

"06 03 67 2A 04"	= "演算法";
"06 03 67 2A 05"	= "規則";
"06 04 67 2A 05 00"	= "根";
"06 03 67 2A 06"	= "模組";
"06 03 67 2A 07"	= "憑證延伸功能";
"06 04 67 2A 07 00"	= "雜湊的根密鑰";
"06 04 67 2A 07 01"	= "憑證類型";
"06 04 67 2A 07 02"	= "廠商資料";
"06 04 67 2A 07 03"	= "需要卡片憑證 ";
"06 04 67 2A 07 04"	= "通道連結中";
"06 04 67 2A 07 05"	= "SET 延伸功能";
"06 04 67 2A 07 06"	= "SET 辨識符號";

"06 03 67 2A 08"	= "商標";
"06 04 67 2A 08 01"		= "IATA-ATA";
"06 04 67 2A 08 04"		= "VISA";
"06 04 67 2A 08 05"		= "MasterCard";
"06 04 67 2A 08 1E"		= "Diners";
"06 04 67 2A 08 22"		= "American Express";
"06 05 67 2A 08 AE 7B"	= "Novus";

"06 03 67 2A 09"	= "廠商";
"06 04 67 2A 09 00"	= "GlobeSet";
"06 04 67 2A 09 01"	= "IBM";
"06 04 67 2A 09 02"	= "CyberCash";
"06 04 67 2A 09 03"	= "Terisa";
"06 04 67 2A 09 04"	= "RSADSI";
"06 04 67 2A 09 05"	= "VeriFone";
"06 04 67 2A 09 06"	= "TrinTech";
"06 04 67 2A 09 07"	= "BankGate";
"06 04 67 2A 09 08"	= "GTE";
"06 04 67 2A 09 09"	= "CompuSource";
"06 04 67 2A 09 0A"	= "Griffin";
"06 04 67 2A 09 0B"	= "Certicom";
"06 04 67 2A 09 0C"	= "OSS";
"06 04 67 2A 09 0D"	= "TenthMountain";
"06 04 67 2A 09 0E"	= "Antares";
"06 04 67 2A 09 0F"	= "ECC";
"06 04 67 2A 09 10"	= "Maithean";
"06 04 67 2A 09 11"	= "Netscape";
"06 04 67 2A 09 12"	= "Verisign";
"06 04 67 2A 09 13"	= "BlueMoney";
"06 04 67 2A 09 14"	= "Lacerte";
"06 04 67 2A 09 15"	= "Fujitsu";
"06 04 67 2A 09 16"	= "eLab";
"06 04 67 2A 09 17"	= "Entrust";
"06 04 67 2A 09 18"	= "VIAnet";
"06 04 67 2A 09 19"	= "III";
"06 04 67 2A 09 1A"	= "OpenMarket";
"06 04 67 2A 09 1B"	= "Lexem";
"06 04 67 2A 09 1C"	= "Intertrader";
"06 04 67 2A 09 1D"	= "Persimmon";
"06 04 67 2A 09 1E"	= "NABLE";
"06 04 67 2A 09 1F"	= "espace-net";
"06 04 67 2A 09 20"	= "Hitachi";
"06 04 67 2A 09 21"	= "Microsoft";
"06 04 67 2A 09 22"	= "NEC";
"06 04 67 2A 09 23"	= "Mitsubishi";
"06 04 67 2A 09 24"	= "NCR";
"06 04 67 2A 09 25"	= "e-COMM";
"06 04 67 2A 09 26"	= "Gemplus";

"06 03 67 2A 0A"	= "國家";
"06 05 67 2A 0A E2 00"	= "日本";

/* Draft SET (deprecated) */

"06 04 86 8D 6F 02"	= "雜湊的根密鑰";
"06 04 86 8D 6F 03"	= "憑證類型";
"06 04 86 8D 6F 04"	= "廠商資料";
"06 04 86 8D 6F 05"	= "需要卡片憑證";
"06 04 86 8D 6F 06"	= "通道連結中";
"06 04 86 8D 6F 07"	= "SET 辨識符號";
"06 04 86 8D 6F 63"	= "SET 資料";

/* Apple */

"06 06 2A 86 48 86 F7 63"		= "Apple";
"06 07 2A 86 48 86 F7 63 64"	= "Apple 資料安全性";

"06 08 2A 86 48 86 F7 63 64 01" = "Apple 信任規則識別碼";
"06 09 2A 86 48 86 F7 63 64 01 01"  = "Apple iSign 規則";
"06 09 2A 86 48 86 F7 63 64 01 02"  = "Apple X.509 初級規則";
"06 09 2A 86 48 86 F7 63 64 01 03"  = "Apple SSL 規則";
"06 09 2A 86 48 86 F7 63 64 01 04"  = "Apple 本機憑證產生規則";
"06 09 2A 86 48 86 F7 63 64 01 05"  = "Apple 本機 CSR 產生規則";
"06 09 2A 86 48 86 F7 63 64 01 06"  = "Apple CRL 撤銷規則";
"06 09 2A 86 48 86 F7 63 64 01 07"  = "Apple OCSP 撤銷規則";
"06 09 2A 86 48 86 F7 63 64 01 08"  = "Apple S/MIME 規則";
"06 09 2A 86 48 86 F7 63 64 01 09"  = "Apple 可延伸的認證規則";
"06 09 2A 86 48 86 F7 63 64 01 0A"  = "Apple 軟體更新簽名規則";
"06 09 2A 86 48 86 F7 63 64 01 0B"  = "Apple IPsec 規則";
"06 09 2A 86 48 86 F7 63 64 01 0C"  = "Apple iChat 規則";
"06 09 2A 86 48 86 F7 63 64 01 0D"  = "Apple 資源簽名規則";
"06 09 2A 86 48 86 F7 63 64 01 0E"  = "Apple Kerberos 用戶端規則";
"06 09 2A 86 48 86 F7 63 64 01 0F"  = "Apple Kerberos 伺服器規則";
"06 09 2A 86 48 86 F7 63 64 01 10"  = "Apple 代碼簽名規則";
"06 09 2A 86 48 86 F7 63 64 01 11"  = "Apple 套件簽名規則";

"06 08 2A 86 48 86 F7 63 64 02" = "Apple 安全性演算法識別碼";
"06 09 2A 86 48 86 F7 63 64 02 01"  = "FEE（Fast Elliptic Encryption）";
"06 09 2A 86 48 86 F7 63 64 02 02"  = "Apple 安全壓縮（ASC）";
"06 09 2A 86 48 86 F7 63 64 02 03"  = "含 MD5 簽名的 FEE";
"06 09 2A 86 48 86 F7 63 64 02 04"  = "含 SHA-1 簽名的 FEE";
"06 09 2A 86 48 86 F7 63 64 02 05"  = "Apple FEED 加密";
"06 09 2A 86 48 86 F7 63 64 02 06"  = "Apple FEED（實驗）";
"06 09 2A 86 48 86 F7 63 64 02 07"  = "含 ECDSA 簽名的 FEE";

"06 08 2A 86 48 86 F7 63 64 03" = "Apple .Mac 憑證識別碼";
"06 09 2A 86 48 86 F7 63 64 03 01"  = "Apple .Mac 憑證要求";
"06 0A 2A 86 48 86 F7 63 64 03 01 01"  = "Apple .Mac 識別憑證要求";
"06 0A 2A 86 48 86 F7 63 64 03 01 02"  = "Apple .Mac 電子郵件簽名憑證要求";
"06 0A 2A 86 48 86 F7 63 64 03 01 03"  = "Apple .Mac 電子郵件加密憑證要求";
"06 0A 2A 86 48 86 F7 63 64 03 01 04"  = "Apple .Mac 封存列表要求";
"06 0A 2A 86 48 86 F7 63 64 03 01 05"  = "Apple .Mac 封存儲存要求";
"06 0A 2A 86 48 86 F7 63 64 03 01 06"  = "Apple .Mac 封存擷取要求";
"06 0A 2A 86 48 86 F7 63 64 03 01 07"  = "Apple .Mac 封存移除要求";
"06 09 2A 86 48 86 F7 63 64 03 02"  = "Apple .Mac 憑證延伸功能";
"06 0A 2A 86 48 86 F7 63 64 03 02 01"   = "Apple .Mac 識別";
"06 0A 2A 86 48 86 F7 63 64 03 02 02"   = "Apple .Mac 電子郵件簽名";
"06 0A 2A 86 48 86 F7 63 64 03 02 03"   = "Apple .Mac 電子郵件加密";
"06 09 2A 86 48 86 F7 63 64 03 03"  = "Apple .Mac 憑證要求值";
"06 0A 2A 86 48 86 F7 63 64 03 03 01"  = "使用者名稱";
"06 0A 2A 86 48 86 F7 63 64 03 03 02"  = "密碼";
"06 0A 2A 86 48 86 F7 63 64 03 03 03"  = "主機名稱";
"06 0A 2A 86 48 86 F7 63 64 03 03 04"  = "更新旗標";
"06 0A 2A 86 48 86 F7 63 64 03 03 05"  = "非同步旗標";

"06 08 2A 86 48 86 F7 63 64 04" = "Apple 延伸密鑰用途";
"06 09 2A 86 48 86 F7 63 64 04 01"  = "Apple 代碼簽名";
"06 0A 2A 86 48 86 F7 63 64 04 01 01"  = "Apple 代碼簽名（開發）";
"06 0A 2A 86 48 86 F7 63 64 04 01 02"  = "Apple 軟體更新簽名";
"06 0A 2A 86 48 86 F7 63 64 04 01 03"  = "Apple 代碼簽名（保留）";
"06 0A 2A 86 48 86 F7 63 64 04 01 04"  = "Apple 資源簽名";
"06 09 2A 86 48 86 F7 63 64 04 02"  = "Apple iChat 簽名";
"06 09 2A 86 48 86 F7 63 64 04 03"  = "Apple iChat 加密";
"06 09 2A 86 48 86 F7 63 64 04 04"  = "Apple 系統識別";

"06 08 2A 86 48 86 F7 63 64 05" = "Apple 憑證規則";
"06 09 2A 86 48 86 F7 63 64 05 01"  = "Apple 憑證規則";
"06 09 2A 86 48 86 F7 63 64 05 02"  = "Apple .Mac 憑證規則";

/* Extended key usage */

"06 04 55 1D 25 03"					= "代碼簽名";

/* Intel CDSA-specific */

"06 07 60 86 48 01 86 F8 4D"	= "Intel";
"06 08 60 86 48 01 86 F8 4D 02"	= "Intel CDSA 安全性";

"06 09 60 86 48 01 86 F8 4D 02 01"	= "Intel CDSA 安全性格式";
"06 0B 60 86 48 01 86 F8 4D 02 01 01 01"	= "X.509v3 憑證延伸功能";
"06 0C 60 86 48 01 86 F8 4D 02 01 01 01 32"	= "X.509v3 專用憑證延伸功能";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 01"	= "主題簽名點陣";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 02"	= "主題圖片";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 03"	= "主題電子郵件位址";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 04"	= "使用免除";

"06 0A 60 86 48 01 86 F8 4D 02 02 05"	= "Intel CDSA 安全性演算法";
"06 0B 60 86 48 01 86 F8 4D 02 02 05 51"	= "含 ECDSA 的 SHA-1";

/* end */
